#loc = loc(unknown)
#loc1 = loc("x.1")
module @blazeface attributes {module.FLOPs = 63714176 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "cv184x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.inputs = ["x.1"], module.mode = "F16", module.outputs = ["199_Concat_f32", "180_Concat_f32"], module.platform = "ONNX", module.q_group_size = 0 : i64, module.q_symmetric = false, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "blazeface_tpu_addressed_cv184x_f16_weight.npz"} {
  module @blazeface attributes {module.coeff_addr = 1101659111424 : i64, module.coeff_size = 454656 : i64, module.device_id = 0 : i64, module.dynamic_coeff_offset = 454656 : i64, module.neuron_addr = 2201170739200 : i64, module.neuron_size = 909312 : i64, module.step = 0 : i64} {
    func.func @main(%arg0: tensor<1x3x128x128xf32> loc(unknown)) -> (tensor<1x896x16xf32, 2201170739200 : i64>, tensor<1x896x1xf32, 2201170825216 : i64>) {
      %0 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = false, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "bgr", resize_dims = [128, 128], scale = [1.000000e+00, 1.000000e+00, 1.000000e+00], yuv_type = ""} : (tensor<1x3x128x128xf32>) -> tensor<1x3x128x128xf32, 2201171394560 : i64> loc(#loc1)
      %1:2 = call @subfunc_0(%0) : (tensor<1x3x128x128xf32, 2201171394560 : i64>) -> (tensor<1x896x16xf32, 2201170739200 : i64>, tensor<1x896x1xf32, 2201170825216 : i64>) loc(#loc)
      return %1#0, %1#1 : tensor<1x896x16xf32, 2201170739200 : i64>, tensor<1x896x1xf32, 2201170825216 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_0(%arg0: tensor<1x3x128x128xf32, 2201171394560 : i64> loc("x.1")) -> (tensor<1x896x16xf32, 2201170739200 : i64>, tensor<1x896x1xf32, 2201170825216 : i64>) attributes {id = 0 : i64, mode = #tpu<run_mode TPU_STATIC>, next_index = array<i32: -1>} {
      %0 = "top.None"() : () -> none loc(#loc)
      %1 = "top.Weight"() : () -> tensor<1x24x1x1xf32, 1101659111424 : i64> loc(#loc2)
      %2 = "top.Weight"() : () -> tensor<1x24x1x200xbf16, 1101659115520 : i64> loc(#loc3)
      %3 = "tpu.Group"(%arg0) ({
        %115 = "tpu.Load"(%arg0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 23552, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [3], d_idx = [0], d_slice = [1], h_idx = [0, 43, 85], h_slice = [46, 45, 43], w_idx = [0], w_slice = [128], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x3x128x128xf32, 2201171394560 : i64>) -> tensor<1x3x128x128xf32> loc(#loc5)
        %116 = "tpu.Load"(%2) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 1200, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [200], id = 1, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x1x200xbf16, 1101659115520 : i64>) -> tensor<1x24x1x200xbf16> loc(#loc6)
        %117 = "tpu.Load"(%1) {do_bcast = false, ginfo = #tpu.lg<out_addr = 53248, out_size = 12, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x1x1xf32, 1101659111424 : i64>) -> tensor<1x24x1x1xf32> loc(#loc7)
        %118 = "tpu.Cast"(%115) {ginfo = #tpu.lg<out_addr = 24576, out_size = 11776, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [3], d_idx = [0], d_slice = [1], h_idx = [0, 43, 85], h_slice = [46, 45, 43], w_idx = [0], w_slice = [128], id = 3, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x3x128x128xf32>) -> tensor<1x3x128x128xbf16> loc(#loc8)
        %119 = "tpu.Conv2D"(%118, %116, %117) {coeff_merged = false, dilations = [1, 1], do_relu = true, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 36864, out_size = 8448, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0, 22, 43], h_slice = [22, 21, 21], w_idx = [0], w_slice = [64], id = 4, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [5, 5], kernel_zp = 0 : i64, multicore = true, pads = [1, 1, 2, 2], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x3x128x128xbf16>, tensor<1x24x1x200xbf16>, tensor<1x24x1x1xf32>) -> tensor<1x24x64x64xbf16> loc(#loc4)
        %120 = "tpu.Store"(%119, %0) {ginfo = #tpu.lg<out_addr = 36864, out_size = 8448, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0, 22, 43], h_slice = [22, 21, 21], w_idx = [0], w_slice = [64], id = 5, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x24x64x64xbf16>, none) -> tensor<1x24x64x64xbf16, 2201170935808 : i64> loc(#loc4)
        "tpu.Yield"(%120) : (tensor<1x24x64x64xbf16, 2201170935808 : i64>) -> () loc(#loc4)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 3, 1, 2, 5, -2, 4, 0], group_type = 0 : i64, hsecs = 3 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x3x128x128xf32, 2201171394560 : i64>) -> tensor<1x24x64x64xbf16, 2201170935808 : i64> loc(#loc4)
      %4 = "top.Weight"() : () -> tensor<1x24x3x3xbf16, 1101659127808 : i64> loc(#loc9)
      %5 = "top.Weight"() : () -> tensor<1x24x1x1xbf16, 1101659131904 : i64> loc(#loc10)
      %6 = "tpu.Conv2D"(%3, %4, %5) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 24 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x24x64x64xbf16, 2201170935808 : i64>, tensor<1x24x3x3xbf16, 1101659127808 : i64>, tensor<1x24x1x1xbf16, 1101659131904 : i64>) -> tensor<1x24x64x64xbf16, 2201170739200 : i64> loc(#loc11)
      %7 = "top.Weight"() : () -> tensor<1x24x1x1xf32, 1101659136000 : i64> loc(#loc12)
      %8 = "top.Weight"() : () -> tensor<1x24x1x24xbf16, 1101659140096 : i64> loc(#loc13)
      %9 = "tpu.Group"(%6, %3) ({
        %115 = "tpu.Load"(%6) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 12288, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0, 32], h_slice = [32, 32], w_idx = [0], w_slice = [64], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x64x64xbf16, 2201170739200 : i64>) -> tensor<1x24x64x64xbf16> loc(#loc15)
        %116 = "tpu.Load"(%8) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 144, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [24], id = 1, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x1x24xbf16, 1101659140096 : i64>) -> tensor<1x24x1x24xbf16> loc(#loc16)
        %117 = "tpu.Load"(%7) {do_bcast = false, ginfo = #tpu.lg<out_addr = 53248, out_size = 12, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x1x1xf32, 1101659136000 : i64>) -> tensor<1x24x1x1xf32> loc(#loc17)
        %118 = "tpu.Load"(%3) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 12288, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0, 32], h_slice = [32, 32], w_idx = [0], w_slice = [64], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x64x64xbf16, 2201170935808 : i64>) -> tensor<1x24x64x64xbf16> loc(#loc18)
        %119 = "tpu.Conv2D"(%115, %116, %117) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 0, out_size = 12288, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0, 32], h_slice = [32, 32], w_idx = [0], w_slice = [64], id = 4, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multicore = true, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x24x64x64xbf16>, tensor<1x24x1x24xbf16>, tensor<1x24x1x1xf32>) -> tensor<1x24x64x64xbf16> loc(#loc19)
        %120 = "tpu.Add"(%119, %118) {do_relu = true, ginfo = #tpu.lg<out_addr = 36864, out_size = 12288, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0, 32], h_slice = [32, 32], w_idx = [0], w_slice = [64], id = 5, stage = 1, slice_idx = 0, group_type = 0>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x24x64x64xbf16>, tensor<1x24x64x64xbf16>) -> tensor<1x24x64x64xbf16> loc(#loc14)
        %121 = "tpu.Store"(%120, %0) {ginfo = #tpu.lg<out_addr = 36864, out_size = 12288, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0, 32], h_slice = [32, 32], w_idx = [0], w_slice = [64], id = 6, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x24x64x64xbf16>, none) -> tensor<1x24x64x64xbf16, 2201171197952 : i64> loc(#loc14)
        "tpu.Yield"(%121) : (tensor<1x24x64x64xbf16, 2201171197952 : i64>) -> () loc(#loc14)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 3, 6, -2, 5, 0, 1, 2], group_type = 0 : i64, hsecs = 2 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x24x64x64xbf16, 2201170739200 : i64>, tensor<1x24x64x64xbf16, 2201170935808 : i64>) -> tensor<1x24x64x64xbf16, 2201171197952 : i64> loc(#loc14)
      %10 = "tpu.Pad"(%9, %0, %0, %0, %0) {mode = #tpu<Pad_Mode constant>, paddings = [0, 0, 0, 0, 0, 4, 0, 0], val = 0.000000e+00 : f64, with_insert_zero = false} : (tensor<1x24x64x64xbf16, 2201171197952 : i64>, none, none, none, none) -> tensor<1x28x64x64xbf16, 2201170968576 : i64> loc(#loc20)
      %11 = "top.Weight"() : () -> tensor<1x24x3x3xbf16, 1101659144192 : i64> loc(#loc21)
      %12 = "top.Weight"() : () -> tensor<1x24x1x1xbf16, 1101659148288 : i64> loc(#loc22)
      %13 = "top.Weight"() : () -> tensor<1x28x1x1xf32, 1101659152384 : i64> loc(#loc23)
      %14 = "top.Weight"() : () -> tensor<1x28x1x24xbf16, 1101659156480 : i64> loc(#loc24)
      %15:2 = "tpu.Group"(%9, %10) ({
        %115 = "tpu.Load"(%9) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 12672, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0, 31], h_slice = [33, 33], w_idx = [0], w_slice = [64], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x64x64xbf16, 2201171197952 : i64>) -> tensor<1x24x64x64xbf16> loc(#loc27)
        %116 = "tpu.Load"(%11) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12864, out_size = 54, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [3], w_idx = [0], w_slice = [3], id = 1, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x3x3xbf16, 1101659144192 : i64>) -> tensor<1x24x3x3xbf16> loc(#loc28)
        %117 = "tpu.Load"(%12) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12944, out_size = 6, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x1x1xbf16, 1101659148288 : i64>) -> tensor<1x24x1x1xbf16> loc(#loc29)
        %118 = "tpu.Load"(%14) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12672, out_size = 192, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [24], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x28x1x24xbf16, 1101659156480 : i64>) -> tensor<1x28x1x24xbf16> loc(#loc30)
        %119 = "tpu.Load"(%13) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12928, out_size = 16, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x28x1x1xf32, 1101659152384 : i64>) -> tensor<1x28x1x1xf32> loc(#loc31)
        %120 = "tpu.Conv2D"(%115, %116, %117) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 53248, out_size = 12288, buffer_addr = 20480, buffer_size = 28831, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0, 32], h_slice = [32, 32], w_idx = [0], w_slice = [64], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 24 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x24x64x64xbf16>, tensor<1x24x3x3xbf16>, tensor<1x24x1x1xbf16>) -> tensor<1x24x64x64xbf16> loc(#loc32)
        %121 = "tpu.Load"(%10) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 16384, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0, 32], h_slice = [32, 32], w_idx = [0], w_slice = [64], id = 6, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x28x64x64xbf16, 2201170968576 : i64>) -> tensor<1x28x64x64xbf16> loc(#loc33)
        %122 = "tpu.Conv2D"(%120, %118, %119) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 16384, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0, 32], h_slice = [32, 32], w_idx = [0], w_slice = [64], id = 7, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multicore = true, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x24x64x64xbf16>, tensor<1x28x1x24xbf16>, tensor<1x28x1x1xf32>) -> tensor<1x28x64x64xbf16> loc(#loc34)
        %123 = "tpu.Add"(%122, %121) {do_relu = true, ginfo = #tpu.lg<out_addr = 49152, out_size = 16384, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0, 32], h_slice = [32, 32], w_idx = [0], w_slice = [64], id = 8, stage = 1, slice_idx = 0, group_type = 0>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x28x64x64xbf16>, tensor<1x28x64x64xbf16>) -> tensor<1x28x64x64xbf16> loc(#loc25)
        %124 = "tpu.Store"(%123, %0) {ginfo = #tpu.lg<out_addr = 49152, out_size = 16384, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0, 32], h_slice = [32, 32], w_idx = [0], w_slice = [64], id = 9, stage = 1, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x28x64x64xbf16>, none) -> tensor<1x28x64x64xbf16, 2201170739200 : i64> loc(#loc25)
        %125 = "tpu.Pool2D"(%123) {count_include_pad = false, do_relu = false, first_round_mode = #tpu<round_mode HalfAwayFromZero>, ginfo = #tpu.lg<out_addr = 16384, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0, 16], h_slice = [16, 16], w_idx = [0], w_slice = [32], id = 10, stage = 1, slice_idx = 0, group_type = 0>, is_adaptive = false, keepdims = true, kernel_shape = [2, 2], pad_value = 0 : i64, pads = [0, 0, 0, 0], pool_mode = #tpu<pool_mode Max>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfAwayFromZero>, strides = [2, 2]} : (tensor<1x28x64x64xbf16>) -> tensor<1x28x32x32xbf16> loc(#loc26)
        %126 = "tpu.Store"(%125, %0) {ginfo = #tpu.lg<out_addr = 16384, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0, 16], h_slice = [16, 16], w_idx = [0], w_slice = [32], id = 11, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x28x32x32xbf16>, none) -> tensor<1x28x32x32xbf16, 2201171591168 : i64> loc(#loc26)
        "tpu.Yield"(%124, %126) : (tensor<1x28x64x64xbf16, 2201170739200 : i64>, tensor<1x28x32x32xbf16, 2201171591168 : i64>) -> () loc(#loc247)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 11, -2, 7, 6, -3, 8, 0, -4, 10, 9, 1, 2], group_type = 0 : i64, hsecs = 2 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x24x64x64xbf16, 2201171197952 : i64>, tensor<1x28x64x64xbf16, 2201170968576 : i64>) -> (tensor<1x28x64x64xbf16, 2201170739200 : i64>, tensor<1x28x32x32xbf16, 2201171591168 : i64>) loc(#loc247)
      %16 = "tpu.Pad"(%15#1, %0, %0, %0, %0) {mode = #tpu<Pad_Mode constant>, paddings = [0, 0, 0, 0, 0, 4, 0, 0], val = 0.000000e+00 : f64, with_insert_zero = false} : (tensor<1x28x32x32xbf16, 2201171591168 : i64>, none, none, none, none) -> tensor<1x32x32x32xbf16, 2201171050496 : i64> loc(#loc35)
      %17 = "top.Weight"() : () -> tensor<1x28x3x3xbf16, 1101659160576 : i64> loc(#loc36)
      %18 = "top.Weight"() : () -> tensor<1x28x1x1xbf16, 1101659164672 : i64> loc(#loc37)
      %19 = "top.Weight"() : () -> tensor<1x32x1x1xf32, 1101659168768 : i64> loc(#loc38)
      %20 = "top.Weight"() : () -> tensor<1x32x1x32xbf16, 1101659172864 : i64> loc(#loc39)
      %21 = "tpu.Group"(%15#0, %16) ({
        %115 = "tpu.Load"(%15#0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 16896, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0, 32], h_slice = [33, 32], w_idx = [0], w_slice = [64], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x28x64x64xbf16, 2201170739200 : i64>) -> tensor<1x28x64x64xbf16> loc(#loc41)
        %116 = "tpu.Load"(%17) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 72, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [3], w_idx = [0], w_slice = [3], id = 1, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x28x3x3xbf16, 1101659160576 : i64>) -> tensor<1x28x3x3xbf16> loc(#loc42)
        %117 = "tpu.Load"(%18) {do_bcast = false, ginfo = #tpu.lg<out_addr = 57344, out_size = 8, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x28x1x1xbf16, 1101659164672 : i64>) -> tensor<1x28x1x1xbf16> loc(#loc43)
        %118 = "tpu.Load"(%20) {do_bcast = false, ginfo = #tpu.lg<out_addr = 45056, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [32], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x32xbf16, 1101659172864 : i64>) -> tensor<1x32x1x32xbf16> loc(#loc44)
        %119 = "tpu.Load"(%19) {do_bcast = false, ginfo = #tpu.lg<out_addr = 53248, out_size = 16, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x1xf32, 1101659168768 : i64>) -> tensor<1x32x1x1xf32> loc(#loc45)
        %120 = "tpu.Conv2D"(%115, %116, %117) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 20480, out_size = 4096, buffer_addr = 24576, buffer_size = 12456, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0, 16], h_slice = [16, 16], w_idx = [0], w_slice = [32], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 28 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [0, 0, 2, 2], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x28x64x64xbf16>, tensor<1x28x3x3xbf16>, tensor<1x28x1x1xbf16>) -> tensor<1x28x32x32xbf16> loc(#loc46)
        %121 = "tpu.Load"(%16) {do_bcast = false, ginfo = #tpu.lg<out_addr = 28672, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 16], h_slice = [16, 16], w_idx = [0], w_slice = [32], id = 6, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x32x32xbf16, 2201171050496 : i64>) -> tensor<1x32x32x32xbf16> loc(#loc47)
        %122 = "tpu.Conv2D"(%120, %118, %119) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 16], h_slice = [16, 16], w_idx = [0], w_slice = [32], id = 7, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multicore = true, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x28x32x32xbf16>, tensor<1x32x1x32xbf16>, tensor<1x32x1x1xf32>) -> tensor<1x32x32x32xbf16> loc(#loc48)
        %123 = "tpu.Add"(%122, %121) {do_relu = true, ginfo = #tpu.lg<out_addr = 40960, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 16], h_slice = [16, 16], w_idx = [0], w_slice = [32], id = 8, stage = 1, slice_idx = 0, group_type = 0>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x32x32xbf16>, tensor<1x32x32x32xbf16>) -> tensor<1x32x32x32xbf16> loc(#loc40)
        %124 = "tpu.Store"(%123, %0) {ginfo = #tpu.lg<out_addr = 40960, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 16], h_slice = [16, 16], w_idx = [0], w_slice = [32], id = 9, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x32x32x32xbf16>, none) -> tensor<1x32x32x32xbf16, 2201170984960 : i64> loc(#loc40)
        "tpu.Yield"(%124) : (tensor<1x32x32x32xbf16, 2201170984960 : i64>) -> () loc(#loc40)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 9, -2, 7, 6, -3, 8, 0, 1, 2], group_type = 0 : i64, hsecs = 2 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x28x64x64xbf16, 2201170739200 : i64>, tensor<1x32x32x32xbf16, 2201171050496 : i64>) -> tensor<1x32x32x32xbf16, 2201170984960 : i64> loc(#loc40)
      %22 = "tpu.Pad"(%21, %0, %0, %0, %0) {mode = #tpu<Pad_Mode constant>, paddings = [0, 0, 0, 0, 0, 4, 0, 0], val = 0.000000e+00 : f64, with_insert_zero = false} : (tensor<1x32x32x32xbf16, 2201170984960 : i64>, none, none, none, none) -> tensor<1x36x32x32xbf16, 2201170739200 : i64> loc(#loc49)
      %23 = "top.Weight"() : () -> tensor<1x32x3x3xbf16, 1101659176960 : i64> loc(#loc50)
      %24 = "top.Weight"() : () -> tensor<1x32x1x1xbf16, 1101659181056 : i64> loc(#loc51)
      %25 = "top.Weight"() : () -> tensor<1x36x1x1xf32, 1101659185152 : i64> loc(#loc52)
      %26 = "top.Weight"() : () -> tensor<1x36x1x32xbf16, 1101659189248 : i64> loc(#loc53)
      %27 = "tpu.Group"(%21, %22) ({
        %115 = "tpu.Load"(%21) {do_bcast = false, ginfo = #tpu.lg<out_addr = 45056, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x32x32xbf16, 2201170984960 : i64>) -> tensor<1x32x32x32xbf16> loc(#loc55)
        %116 = "tpu.Load"(%23) {do_bcast = false, ginfo = #tpu.lg<out_addr = 53248, out_size = 72, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [3], w_idx = [0], w_slice = [3], id = 1, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x3x3xbf16, 1101659176960 : i64>) -> tensor<1x32x3x3xbf16> loc(#loc56)
        %117 = "tpu.Load"(%24) {do_bcast = false, ginfo = #tpu.lg<out_addr = 61440, out_size = 8, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x1xbf16, 1101659181056 : i64>) -> tensor<1x32x1x1xbf16> loc(#loc57)
        %118 = "tpu.Load"(%26) {do_bcast = false, ginfo = #tpu.lg<out_addr = 34816, out_size = 320, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [32], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x36x1x32xbf16, 1101659189248 : i64>) -> tensor<1x36x1x32xbf16> loc(#loc58)
        %119 = "tpu.Load"(%25) {do_bcast = false, ginfo = #tpu.lg<out_addr = 57344, out_size = 20, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x36x1x1xf32, 1101659185152 : i64>) -> tensor<1x36x1x1xf32> loc(#loc59)
        %120 = "tpu.Conv2D"(%115, %116, %117) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 36864, out_size = 8192, buffer_addr = 0, buffer_size = 18472, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 32 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x32x32xbf16>, tensor<1x32x3x3xbf16>, tensor<1x32x1x1xbf16>) -> tensor<1x32x32x32xbf16> loc(#loc60)
        %121 = "tpu.Load"(%22) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 10240, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 6, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x36x32x32xbf16, 2201170739200 : i64>) -> tensor<1x36x32x32xbf16> loc(#loc61)
        %122 = "tpu.Conv2D"(%120, %118, %119) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 0, out_size = 10240, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 7, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multicore = true, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x32x32xbf16>, tensor<1x36x1x32xbf16>, tensor<1x36x1x1xf32>) -> tensor<1x36x32x32xbf16> loc(#loc62)
        %123 = "tpu.Add"(%122, %121) {do_relu = true, ginfo = #tpu.lg<out_addr = 24576, out_size = 10240, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 8, stage = 1, slice_idx = 0, group_type = 0>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x36x32x32xbf16>, tensor<1x36x32x32xbf16>) -> tensor<1x36x32x32xbf16> loc(#loc54)
        %124 = "tpu.Store"(%123, %0) {ginfo = #tpu.lg<out_addr = 24576, out_size = 10240, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 9, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x36x32x32xbf16>, none) -> tensor<1x36x32x32xbf16, 2201170911232 : i64> loc(#loc54)
        "tpu.Yield"(%124) : (tensor<1x36x32x32xbf16, 2201170911232 : i64>) -> () loc(#loc54)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 9, -2, 7, 6, -3, 8, 0, 1, 2], group_type = 0 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x32x32x32xbf16, 2201170984960 : i64>, tensor<1x36x32x32xbf16, 2201170739200 : i64>) -> tensor<1x36x32x32xbf16, 2201170911232 : i64> loc(#loc54)
      %28 = "tpu.Pad"(%27, %0, %0, %0, %0) {mode = #tpu<Pad_Mode constant>, paddings = [0, 0, 0, 0, 0, 6, 0, 0], val = 0.000000e+00 : f64, with_insert_zero = false} : (tensor<1x36x32x32xbf16, 2201170911232 : i64>, none, none, none, none) -> tensor<1x42x32x32xbf16, 2201170825216 : i64> loc(#loc63)
      %29 = "top.Weight"() : () -> tensor<1x36x3x3xbf16, 1101659193344 : i64> loc(#loc64)
      %30 = "top.Weight"() : () -> tensor<1x36x1x1xbf16, 1101659197440 : i64> loc(#loc65)
      %31 = "top.Weight"() : () -> tensor<1x42x1x1xf32, 1101659201536 : i64> loc(#loc66)
      %32 = "top.Weight"() : () -> tensor<1x42x1x40xbf16, 1101659205632 : i64> loc(#loc67)
      %33:2 = "tpu.Group"(%27, %28) ({
        %115 = "tpu.Load"(%30) {do_bcast = false, ginfo = #tpu.lg<out_addr = 10240, out_size = 10, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x36x1x1xbf16, 1101659197440 : i64>) -> tensor<1x36x1x1xbf16> loc(#loc70)
        %116 = "tpu.Load"(%27) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 10240, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 1, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x36x32x32xbf16, 2201170911232 : i64>) -> tensor<1x36x32x32xbf16> loc(#loc71)
        %117 = "tpu.Load"(%29) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 90, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [3], w_idx = [0], w_slice = [3], id = 2, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x36x3x3xbf16, 1101659193344 : i64>) -> tensor<1x36x3x3xbf16> loc(#loc72)
        %118 = "tpu.Load"(%32) {do_bcast = false, ginfo = #tpu.lg<out_addr = 57344, out_size = 480, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [40], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x42x1x40xbf16, 1101659205632 : i64>) -> tensor<1x42x1x40xbf16> loc(#loc73)
        %119 = "tpu.Load"(%31) {do_bcast = false, ginfo = #tpu.lg<out_addr = 61440, out_size = 24, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x42x1x1xf32, 1101659201536 : i64>) -> tensor<1x42x1x1xf32> loc(#loc74)
        %120 = "tpu.Conv2D"(%116, %117, %115) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 45056, out_size = 10240, buffer_addr = 20480, buffer_size = 22577, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 36 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x36x32x32xbf16>, tensor<1x36x3x3xbf16>, tensor<1x36x1x1xbf16>) -> tensor<1x36x32x32xbf16> loc(#loc75)
        %121 = "tpu.Load"(%28) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 12288, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 6, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x42x32x32xbf16, 2201170825216 : i64>) -> tensor<1x42x32x32xbf16> loc(#loc76)
        %122 = "tpu.Conv2D"(%120, %118, %119) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 12288, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 7, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multicore = true, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x36x32x32xbf16>, tensor<1x42x1x40xbf16>, tensor<1x42x1x1xf32>) -> tensor<1x42x32x32xbf16> loc(#loc77)
        %123 = "tpu.Add"(%122, %121) {do_relu = true, ginfo = #tpu.lg<out_addr = 36864, out_size = 12288, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 8, stage = 1, slice_idx = 0, group_type = 0>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x42x32x32xbf16>, tensor<1x42x32x32xbf16>) -> tensor<1x42x32x32xbf16> loc(#loc68)
        %124 = "tpu.Store"(%123, %0) {ginfo = #tpu.lg<out_addr = 36864, out_size = 12288, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 9, stage = 1, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x42x32x32xbf16>, none) -> tensor<1x42x32x32xbf16, 2201170739200 : i64> loc(#loc68)
        %125 = "tpu.Pool2D"(%123) {count_include_pad = false, do_relu = false, first_round_mode = #tpu<round_mode HalfAwayFromZero>, ginfo = #tpu.lg<out_addr = 12288, out_size = 3072, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [16], id = 10, stage = 1, slice_idx = 0, group_type = 0>, is_adaptive = false, keepdims = true, kernel_shape = [2, 2], pad_value = 0 : i64, pads = [0, 0, 0, 0], pool_mode = #tpu<pool_mode Max>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfAwayFromZero>, strides = [2, 2]} : (tensor<1x42x32x32xbf16>) -> tensor<1x42x16x16xbf16> loc(#loc69)
        %126 = "tpu.Store"(%125, %0) {ginfo = #tpu.lg<out_addr = 12288, out_size = 3072, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [16], id = 11, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x42x16x16xbf16>, none) -> tensor<1x42x16x16xbf16, 2201170984960 : i64> loc(#loc69)
        "tpu.Yield"(%124, %126) : (tensor<1x42x32x32xbf16, 2201170739200 : i64>, tensor<1x42x16x16xbf16, 2201170984960 : i64>) -> () loc(#loc248)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 11, -2, 7, 6, 0, -3, 8, 1, -4, 10, 9, 2], group_type = 0 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x36x32x32xbf16, 2201170911232 : i64>, tensor<1x42x32x32xbf16, 2201170825216 : i64>) -> (tensor<1x42x32x32xbf16, 2201170739200 : i64>, tensor<1x42x16x16xbf16, 2201170984960 : i64>) loc(#loc248)
      %34 = "tpu.Pad"(%33#1, %0, %0, %0, %0) {mode = #tpu<Pad_Mode constant>, paddings = [0, 0, 0, 0, 0, 6, 0, 0], val = 0.000000e+00 : f64, with_insert_zero = false} : (tensor<1x42x16x16xbf16, 2201170984960 : i64>, none, none, none, none) -> tensor<1x48x16x16xbf16, 2201170849792 : i64> loc(#loc78)
      %35 = "top.Weight"() : () -> tensor<1x42x3x3xbf16, 1101659209728 : i64> loc(#loc79)
      %36 = "top.Weight"() : () -> tensor<1x42x1x1xbf16, 1101659213824 : i64> loc(#loc80)
      %37 = "top.Weight"() : () -> tensor<1x48x1x1xf32, 1101659217920 : i64> loc(#loc81)
      %38 = "top.Weight"() : () -> tensor<1x48x1x48xbf16, 1101659222016 : i64> loc(#loc82)
      %39 = "tpu.Group"(%33#0, %34) ({
        %115 = "tpu.Load"(%36) {do_bcast = false, ginfo = #tpu.lg<out_addr = 40960, out_size = 12, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x42x1x1xbf16, 1101659213824 : i64>) -> tensor<1x42x1x1xbf16> loc(#loc84)
        %116 = "tpu.Load"(%33#0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 12288, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 1, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x42x32x32xbf16, 2201170739200 : i64>) -> tensor<1x42x32x32xbf16> loc(#loc85)
        %117 = "tpu.Load"(%35) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 108, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [3], w_idx = [0], w_slice = [3], id = 2, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x42x3x3xbf16, 1101659209728 : i64>) -> tensor<1x42x3x3xbf16> loc(#loc86)
        %118 = "tpu.Load"(%38) {do_bcast = false, ginfo = #tpu.lg<out_addr = 31744, out_size = 576, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [48], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [48], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x48x1x48xbf16, 1101659222016 : i64>) -> tensor<1x48x1x48xbf16> loc(#loc87)
        %119 = "tpu.Load"(%37) {do_bcast = false, ginfo = #tpu.lg<out_addr = 36864, out_size = 24, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [48], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x48x1x1xf32, 1101659217920 : i64>) -> tensor<1x48x1x1xf32> loc(#loc88)
