#loc = loc(unknown)
#loc1 = loc("x.1")
module @blazeface attributes {module.FLOPs = 63714176 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "bm1688", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.inputs = ["x.1"], module.mode = "F16", module.outputs = ["199_Concat_f32", "180_Concat_f32"], module.platform = "ONNX", module.q_group_size = 0 : i64, module.q_symmetric = false, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "blazeface_tpu_addressed_bm1688_f16_weight.npz"} {
  module @blazeface attributes {module.coeff_addr = 618475290624 : i64, module.coeff_size = 450560 : i64, module.device_id = 0 : i64, module.dynamic_coeff_offset = 450560 : i64, module.neuron_addr = 687194767360 : i64, module.neuron_size = 909312 : i64, module.step = 0 : i64} {
    func.func @main(%arg0: tensor<1x3x128x128xf32> loc(unknown)) -> (tensor<1x896x16xf32, 687194767360 : i64>, tensor<1x896x1xf32, 687194857472 : i64>) {
      %0 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = false, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "bgr", resize_dims = [128, 128], scale = [1.000000e+00, 1.000000e+00, 1.000000e+00], yuv_type = ""} : (tensor<1x3x128x128xf32>) -> tensor<1x3x128x128xf32, 687195422720 : i64> loc(#loc1)
      %1:2 = call @subfunc_0(%0) : (tensor<1x3x128x128xf32, 687195422720 : i64>) -> (tensor<1x896x16xf32, 687194767360 : i64>, tensor<1x896x1xf32, 687194857472 : i64>) loc(#loc)
      return %1#0, %1#1 : tensor<1x896x16xf32, 687194767360 : i64>, tensor<1x896x1xf32, 687194857472 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_0(%arg0: tensor<1x3x128x128xf32, 687195422720 : i64> loc("x.1")) -> (tensor<1x896x16xf32, 687194767360 : i64>, tensor<1x896x1xf32, 687194857472 : i64>) attributes {id = 0 : i64, mode = #tpu<run_mode TPU_STATIC>, next_index = array<i32: -1>} {
      %0 = "top.None"() : () -> none loc(#loc)
      %1 = "tpu.Cast"(%arg0) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x3x128x128xf32, 687195422720 : i64>) -> tensor<1x3x128x128xf16, 687194767360 : i64> loc(#loc2)
      %2 = "top.Weight"() : () -> tensor<1x24x1x1xf32, 618475290624 : i64> loc(#loc3)
      %3 = "top.Weight"() : () -> tensor<1x24x1x80xf16, 618475294720 : i64> loc(#loc4)
      %4 = "top.Weight"() : () -> tensor<1x24x3x3xf16, 618475298816 : i64> loc(#loc5)
      %5 = "top.Weight"() : () -> tensor<1x24x1x1xf16, 618475302912 : i64> loc(#loc6)
      %6 = "top.Weight"() : () -> tensor<1x24x1x1xf32, 618475307008 : i64> loc(#loc7)
      %7 = "top.Weight"() : () -> tensor<1x24x1x32xf16, 618475311104 : i64> loc(#loc8)
      %8 = "tpu.Group"(%1) ({
        %113 = "tpu.Load"(%1) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 32768, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [3], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [128], w_idx = [0], w_slice = [128], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 17 : i64} : (tensor<1x3x128x128xf16, 687194767360 : i64>) -> tensor<1x3x128x128xf16> loc(#loc10)
        %114 = "tpu.Load"(%3) {do_bcast = false, ginfo = #tpu.lg<out_addr = 73728, out_size = 160, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [80], id = 1, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x1x80xf16, 618475294720 : i64>) -> tensor<1x24x1x80xf16> loc(#loc11)
        %115 = "tpu.Load"(%2) {do_bcast = false, ginfo = #tpu.lg<out_addr = 98304, out_size = 4, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x1x1xf32, 618475290624 : i64>) -> tensor<1x24x1x1xf32> loc(#loc12)
        %116 = "tpu.Load"(%4) {do_bcast = false, ginfo = #tpu.lg<out_addr = 81920, out_size = 18, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [3], w_idx = [0], w_slice = [3], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x3x3xf16, 618475298816 : i64>) -> tensor<1x24x3x3xf16> loc(#loc13)
        %117 = "tpu.Load"(%5) {do_bcast = false, ginfo = #tpu.lg<out_addr = 106496, out_size = 2, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x1x1xf16, 618475302912 : i64>) -> tensor<1x24x1x1xf16> loc(#loc14)
        %118 = "tpu.Conv2D"(%113, %114, %115) {coeff_merged = false, dilations = [1, 1], do_relu = true, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 8192, buffer_addr = 40960, buffer_size = 16426, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [64], w_idx = [0], w_slice = [64], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [5, 5], kernel_zp = 0 : i64, multicore = true, pads = [1, 1, 2, 2], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 17 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x3x128x128xf16>, tensor<1x24x1x80xf16>, tensor<1x24x1x1xf32>) -> tensor<1x24x64x64xf16> loc(#loc15)
        %119 = "tpu.Load"(%7) {do_bcast = false, ginfo = #tpu.lg<out_addr = 57344, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [32], id = 6, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x1x32xf16, 618475311104 : i64>) -> tensor<1x24x1x32xf16> loc(#loc16)
        %120 = "tpu.Load"(%6) {do_bcast = false, ginfo = #tpu.lg<out_addr = 90112, out_size = 4, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 7, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x1x1xf32, 618475307008 : i64>) -> tensor<1x24x1x1xf32> loc(#loc17)
        %121 = "tpu.Conv2D"(%118, %116, %117) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 40960, out_size = 8192, buffer_addr = 0, buffer_size = 24589, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [64], w_idx = [0], w_slice = [64], id = 8, stage = 1, slice_idx = 0, group_type = 0>, group = 24 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x24x64x64xf16>, tensor<1x24x3x3xf16>, tensor<1x24x1x1xf16>) -> tensor<1x24x64x64xf16> loc(#loc18)
        %122 = "tpu.Conv2D"(%121, %119, %120) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [64], w_idx = [0], w_slice = [64], id = 9, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multicore = true, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x24x64x64xf16>, tensor<1x24x1x32xf16>, tensor<1x24x1x1xf32>) -> tensor<1x24x64x64xf16> loc(#loc19)
        %123 = "tpu.Add"(%122, %118) {do_relu = true, ginfo = #tpu.lg<out_addr = 65536, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [64], w_idx = [0], w_slice = [64], id = 10, stage = 1, slice_idx = 0, group_type = 0>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x24x64x64xf16>, tensor<1x24x64x64xf16>) -> tensor<1x24x64x64xf16> loc(#loc9)
        %124 = "tpu.Store"(%123, %0) {ginfo = #tpu.lg<out_addr = 65536, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [64], w_idx = [0], w_slice = [64], id = 11, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x24x64x64xf16>, none) -> tensor<1x24x64x64xf16, 687195226112 : i64> loc(#loc9)
        "tpu.Yield"(%124) : (tensor<1x24x64x64xf16, 687195226112 : i64>) -> () loc(#loc9)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 11, -2, 8, 6, 7, -3, 9, 10, 0, 1, 2], group_type = 0 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x3x128x128xf16, 687194767360 : i64>) -> tensor<1x24x64x64xf16, 687195226112 : i64> loc(#loc9)
      %9 = "tpu.Pad"(%8, %0, %0, %0, %0) {mode = #tpu<Pad_Mode constant>, paddings = [0, 0, 0, 0, 0, 4, 0, 0], val = 0.000000e+00 : f64, with_insert_zero = false} : (tensor<1x24x64x64xf16, 687195226112 : i64>, none, none, none, none) -> tensor<1x28x64x64xf16, 687194996736 : i64> loc(#loc20)
      %10 = "top.Weight"() : () -> tensor<1x24x3x3xf16, 618475315200 : i64> loc(#loc21)
      %11 = "top.Weight"() : () -> tensor<1x24x1x1xf16, 618475319296 : i64> loc(#loc22)
      %12 = "top.Weight"() : () -> tensor<1x28x1x1xf32, 618475323392 : i64> loc(#loc23)
      %13 = "top.Weight"() : () -> tensor<1x28x1x32xf16, 618475327488 : i64> loc(#loc24)
      %14:2 = "tpu.Group"(%8, %9) ({
        %113 = "tpu.Load"(%8) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [64], w_idx = [0], w_slice = [64], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x64x64xf16, 687195226112 : i64>) -> tensor<1x24x64x64xf16> loc(#loc27)
        %114 = "tpu.Load"(%10) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 18, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [3], w_idx = [0], w_slice = [3], id = 1, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x3x3xf16, 618475315200 : i64>) -> tensor<1x24x3x3xf16> loc(#loc28)
        %115 = "tpu.Load"(%11) {do_bcast = false, ginfo = #tpu.lg<out_addr = 81920, out_size = 2, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x24x1x1xf16, 618475319296 : i64>) -> tensor<1x24x1x1xf16> loc(#loc29)
        %116 = "tpu.Load"(%13) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [32], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x28x1x32xf16, 618475327488 : i64>) -> tensor<1x28x1x32xf16> loc(#loc30)
        %117 = "tpu.Load"(%12) {do_bcast = false, ginfo = #tpu.lg<out_addr = 40960, out_size = 4, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x28x1x1xf32, 618475323392 : i64>) -> tensor<1x28x1x1xf32> loc(#loc31)
        %118 = "tpu.Conv2D"(%113, %114, %115) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 8192, buffer_addr = 49152, buffer_size = 24589, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [24], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [64], w_idx = [0], w_slice = [64], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 24 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x24x64x64xf16>, tensor<1x24x3x3xf16>, tensor<1x24x1x1xf16>) -> tensor<1x24x64x64xf16> loc(#loc32)
        %119 = "tpu.Load"(%9) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [64], w_idx = [0], w_slice = [64], id = 6, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x28x64x64xf16, 687194996736 : i64>) -> tensor<1x28x64x64xf16> loc(#loc33)
        %120 = "tpu.Conv2D"(%118, %116, %117) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [64], w_idx = [0], w_slice = [64], id = 7, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multicore = true, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x24x64x64xf16>, tensor<1x28x1x32xf16>, tensor<1x28x1x1xf32>) -> tensor<1x28x64x64xf16> loc(#loc34)
        %121 = "tpu.Add"(%120, %119) {do_relu = true, ginfo = #tpu.lg<out_addr = 8192, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [64], w_idx = [0], w_slice = [64], id = 8, stage = 1, slice_idx = 0, group_type = 0>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x28x64x64xf16>, tensor<1x28x64x64xf16>) -> tensor<1x28x64x64xf16> loc(#loc25)
        %122 = "tpu.Store"(%121, %0) {ginfo = #tpu.lg<out_addr = 8192, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [64], w_idx = [0], w_slice = [64], id = 9, stage = 1, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x28x64x64xf16>, none) -> tensor<1x28x64x64xf16, 687194767360 : i64> loc(#loc25)
        %123 = "tpu.Pool2D"(%121) {count_include_pad = false, do_relu = false, first_round_mode = #tpu<round_mode HalfAwayFromZero>, ginfo = #tpu.lg<out_addr = 16384, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 10, stage = 1, slice_idx = 0, group_type = 0>, is_adaptive = false, keepdims = true, kernel_shape = [2, 2], pad_value = 0 : i64, pads = [0, 0, 0, 0], pool_mode = #tpu<pool_mode Max>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfAwayFromZero>, strides = [2, 2]} : (tensor<1x28x64x64xf16>) -> tensor<1x28x32x32xf16> loc(#loc26)
        %124 = "tpu.Store"(%123, %0) {ginfo = #tpu.lg<out_addr = 16384, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 11, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x28x32x32xf16>, none) -> tensor<1x28x32x32xf16, 687195619328 : i64> loc(#loc26)
        "tpu.Yield"(%122, %124) : (tensor<1x28x64x64xf16, 687194767360 : i64>, tensor<1x28x32x32xf16, 687195619328 : i64>) -> () loc(#loc249)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 11, -2, 7, 6, -3, 8, 0, -4, 10, 9, 1, 2], group_type = 0 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x24x64x64xf16, 687195226112 : i64>, tensor<1x28x64x64xf16, 687194996736 : i64>) -> (tensor<1x28x64x64xf16, 687194767360 : i64>, tensor<1x28x32x32xf16, 687195619328 : i64>) loc(#loc249)
      %15 = "tpu.Pad"(%14#1, %0, %0, %0, %0) {mode = #tpu<Pad_Mode constant>, paddings = [0, 0, 0, 0, 0, 4, 0, 0], val = 0.000000e+00 : f64, with_insert_zero = false} : (tensor<1x28x32x32xf16, 687195619328 : i64>, none, none, none, none) -> tensor<1x32x32x32xf16, 687195078656 : i64> loc(#loc35)
      %16 = "top.Weight"() : () -> tensor<1x28x3x3xf16, 618475331584 : i64> loc(#loc36)
      %17 = "top.Weight"() : () -> tensor<1x28x1x1xf16, 618475335680 : i64> loc(#loc37)
      %18 = "top.Weight"() : () -> tensor<1x32x1x1xf32, 618475339776 : i64> loc(#loc38)
      %19 = "top.Weight"() : () -> tensor<1x32x1x32xf16, 618475343872 : i64> loc(#loc39)
      %20 = "tpu.Group"(%14#0, %15) ({
        %113 = "tpu.Load"(%14#0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [64], w_idx = [0], w_slice = [64], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x28x64x64xf16, 687194767360 : i64>) -> tensor<1x28x64x64xf16> loc(#loc41)
        %114 = "tpu.Load"(%16) {do_bcast = false, ginfo = #tpu.lg<out_addr = 40960, out_size = 18, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [3], w_idx = [0], w_slice = [3], id = 1, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x28x3x3xf16, 618475331584 : i64>) -> tensor<1x28x3x3xf16> loc(#loc42)
        %115 = "tpu.Load"(%17) {do_bcast = false, ginfo = #tpu.lg<out_addr = 57344, out_size = 2, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x28x1x1xf16, 618475335680 : i64>) -> tensor<1x28x1x1xf16> loc(#loc43)
        %116 = "tpu.Load"(%19) {do_bcast = false, ginfo = #tpu.lg<out_addr = 34816, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [32], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x32xf16, 618475343872 : i64>) -> tensor<1x32x1x32xf16> loc(#loc44)
        %117 = "tpu.Load"(%18) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 4, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x1xf32, 618475339776 : i64>) -> tensor<1x32x1x1xf32> loc(#loc45)
        %118 = "tpu.Conv2D"(%113, %114, %115) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 2048, buffer_addr = 16384, buffer_size = 12301, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [28], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 28 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [0, 0, 2, 2], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x28x64x64xf16>, tensor<1x28x3x3xf16>, tensor<1x28x1x1xf16>) -> tensor<1x28x32x32xf16> loc(#loc46)
        %119 = "tpu.Load"(%15) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 6, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x32x32xf16, 687195078656 : i64>) -> tensor<1x32x32x32xf16> loc(#loc47)
        %120 = "tpu.Conv2D"(%118, %116, %117) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 7, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multicore = true, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x28x32x32xf16>, tensor<1x32x1x32xf16>, tensor<1x32x1x1xf32>) -> tensor<1x32x32x32xf16> loc(#loc48)
        %121 = "tpu.Add"(%120, %119) {do_relu = true, ginfo = #tpu.lg<out_addr = 32768, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 8, stage = 1, slice_idx = 0, group_type = 0>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x32x32xf16>, tensor<1x32x32x32xf16>) -> tensor<1x32x32x32xf16> loc(#loc40)
        %122 = "tpu.Store"(%121, %0) {ginfo = #tpu.lg<out_addr = 32768, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 9, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x32x32x32xf16>, none) -> tensor<1x32x32x32xf16, 687195013120 : i64> loc(#loc40)
        "tpu.Yield"(%122) : (tensor<1x32x32x32xf16, 687195013120 : i64>) -> () loc(#loc40)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 9, -2, 7, 6, -3, 8, 0, 1, 2], group_type = 0 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x28x64x64xf16, 687194767360 : i64>, tensor<1x32x32x32xf16, 687195078656 : i64>) -> tensor<1x32x32x32xf16, 687195013120 : i64> loc(#loc40)
      %21 = "tpu.Pad"(%20, %0, %0, %0, %0) {mode = #tpu<Pad_Mode constant>, paddings = [0, 0, 0, 0, 0, 4, 0, 0], val = 0.000000e+00 : f64, with_insert_zero = false} : (tensor<1x32x32x32xf16, 687195013120 : i64>, none, none, none, none) -> tensor<1x36x32x32xf16, 687194767360 : i64> loc(#loc49)
      %22 = "top.Weight"() : () -> tensor<1x32x3x3xf16, 618475347968 : i64> loc(#loc50)
      %23 = "top.Weight"() : () -> tensor<1x32x1x1xf16, 618475352064 : i64> loc(#loc51)
      %24 = "top.Weight"() : () -> tensor<1x36x1x1xf32, 618475356160 : i64> loc(#loc52)
      %25 = "top.Weight"() : () -> tensor<1x36x1x32xf16, 618475360256 : i64> loc(#loc53)
      %26 = "tpu.Group"(%20, %21) ({
        %113 = "tpu.Load"(%20) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x32x32xf16, 687195013120 : i64>) -> tensor<1x32x32x32xf16> loc(#loc55)
        %114 = "tpu.Load"(%22) {do_bcast = false, ginfo = #tpu.lg<out_addr = 40960, out_size = 18, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [3], w_idx = [0], w_slice = [3], id = 1, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x3x3xf16, 618475347968 : i64>) -> tensor<1x32x3x3xf16> loc(#loc56)
        %115 = "tpu.Load"(%23) {do_bcast = false, ginfo = #tpu.lg<out_addr = 57344, out_size = 2, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x1xf16, 618475352064 : i64>) -> tensor<1x32x1x1xf16> loc(#loc57)
        %116 = "tpu.Load"(%25) {do_bcast = false, ginfo = #tpu.lg<out_addr = 20480, out_size = 128, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [32], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x36x1x32xf16, 618475360256 : i64>) -> tensor<1x36x1x32xf16> loc(#loc58)
        %117 = "tpu.Load"(%24) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 8, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x36x1x1xf32, 618475356160 : i64>) -> tensor<1x36x1x1xf32> loc(#loc59)
        %118 = "tpu.Conv2D"(%113, %114, %115) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 2048, buffer_addr = 0, buffer_size = 6157, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 32 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x32x32xf16>, tensor<1x32x3x3xf16>, tensor<1x32x1x1xf16>) -> tensor<1x32x32x32xf16> loc(#loc60)
        %119 = "tpu.Load"(%21) {do_bcast = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 6, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x36x32x32xf16, 687194767360 : i64>) -> tensor<1x36x32x32xf16> loc(#loc61)
        %120 = "tpu.Conv2D"(%118, %116, %117) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 0, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 7, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multicore = true, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x32x32xf16>, tensor<1x36x1x32xf16>, tensor<1x36x1x1xf32>) -> tensor<1x36x32x32xf16> loc(#loc62)
        %121 = "tpu.Add"(%120, %119) {do_relu = true, ginfo = #tpu.lg<out_addr = 16384, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 8, stage = 1, slice_idx = 0, group_type = 0>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x36x32x32xf16>, tensor<1x36x32x32xf16>) -> tensor<1x36x32x32xf16> loc(#loc54)
        %122 = "tpu.Store"(%121, %0) {ginfo = #tpu.lg<out_addr = 16384, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 9, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x36x32x32xf16>, none) -> tensor<1x36x32x32xf16, 687194939392 : i64> loc(#loc54)
        "tpu.Yield"(%122) : (tensor<1x36x32x32xf16, 687194939392 : i64>) -> () loc(#loc54)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 9, -2, 7, 6, -3, 8, 0, 1, 2], group_type = 0 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x32x32x32xf16, 687195013120 : i64>, tensor<1x36x32x32xf16, 687194767360 : i64>) -> tensor<1x36x32x32xf16, 687194939392 : i64> loc(#loc54)
      %27 = "tpu.Pad"(%26, %0, %0, %0, %0) {mode = #tpu<Pad_Mode constant>, paddings = [0, 0, 0, 0, 0, 6, 0, 0], val = 0.000000e+00 : f64, with_insert_zero = false} : (tensor<1x36x32x32xf16, 687194939392 : i64>, none, none, none, none) -> tensor<1x42x32x32xf16, 687194853376 : i64> loc(#loc63)
      %28 = "top.Weight"() : () -> tensor<1x36x3x3xf16, 618475364352 : i64> loc(#loc64)
      %29 = "top.Weight"() : () -> tensor<1x36x1x1xf16, 618475368448 : i64> loc(#loc65)
      %30 = "top.Weight"() : () -> tensor<1x42x1x1xf32, 618475372544 : i64> loc(#loc66)
      %31 = "top.Weight"() : () -> tensor<1x42x1x48xf16, 618475376640 : i64> loc(#loc67)
      %32:2 = "tpu.Group"(%26, %27) ({
        %113 = "tpu.Load"(%26) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x36x32x32xf16, 687194939392 : i64>) -> tensor<1x36x32x32xf16> loc(#loc70)
        %114 = "tpu.Load"(%28) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 36, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [3], w_idx = [0], w_slice = [3], id = 1, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x36x3x3xf16, 618475364352 : i64>) -> tensor<1x36x3x3xf16> loc(#loc71)
        %115 = "tpu.Load"(%29) {do_bcast = false, ginfo = #tpu.lg<out_addr = 65536, out_size = 4, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x36x1x1xf16, 618475368448 : i64>) -> tensor<1x36x1x1xf16> loc(#loc72)
        %116 = "tpu.Load"(%31) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 192, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [48], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x42x1x48xf16, 618475376640 : i64>) -> tensor<1x42x1x48xf16> loc(#loc73)
        %117 = "tpu.Load"(%30) {do_bcast = false, ginfo = #tpu.lg<out_addr = 40960, out_size = 8, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x42x1x1xf32, 618475372544 : i64>) -> tensor<1x42x1x1xf32> loc(#loc74)
        %118 = "tpu.Conv2D"(%113, %114, %115) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 4096, buffer_addr = 49152, buffer_size = 10262, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [36], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 36 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x36x32x32xf16>, tensor<1x36x3x3xf16>, tensor<1x36x1x1xf16>) -> tensor<1x36x32x32xf16> loc(#loc75)
        %119 = "tpu.Load"(%27) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 6, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x42x32x32xf16, 687194853376 : i64>) -> tensor<1x42x32x32xf16> loc(#loc76)
        %120 = "tpu.Conv2D"(%118, %116, %117) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 7, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multicore = true, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x36x32x32xf16>, tensor<1x42x1x48xf16>, tensor<1x42x1x1xf32>) -> tensor<1x42x32x32xf16> loc(#loc77)
        %121 = "tpu.Add"(%120, %119) {do_relu = true, ginfo = #tpu.lg<out_addr = 8192, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 8, stage = 1, slice_idx = 0, group_type = 0>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x42x32x32xf16>, tensor<1x42x32x32xf16>) -> tensor<1x42x32x32xf16> loc(#loc68)
        %122 = "tpu.Store"(%121, %0) {ginfo = #tpu.lg<out_addr = 8192, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 9, stage = 1, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x42x32x32xf16>, none) -> tensor<1x42x32x32xf16, 687194767360 : i64> loc(#loc68)
        %123 = "tpu.Pool2D"(%121) {count_include_pad = false, do_relu = false, first_round_mode = #tpu<round_mode HalfAwayFromZero>, ginfo = #tpu.lg<out_addr = 16384, out_size = 1024, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [16], id = 10, stage = 1, slice_idx = 0, group_type = 0>, is_adaptive = false, keepdims = true, kernel_shape = [2, 2], pad_value = 0 : i64, pads = [0, 0, 0, 0], pool_mode = #tpu<pool_mode Max>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfAwayFromZero>, strides = [2, 2]} : (tensor<1x42x32x32xf16>) -> tensor<1x42x16x16xf16> loc(#loc69)
        %124 = "tpu.Store"(%123, %0) {ginfo = #tpu.lg<out_addr = 16384, out_size = 1024, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [16], id = 11, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x42x16x16xf16>, none) -> tensor<1x42x16x16xf16, 687195013120 : i64> loc(#loc69)
        "tpu.Yield"(%122, %124) : (tensor<1x42x32x32xf16, 687194767360 : i64>, tensor<1x42x16x16xf16, 687195013120 : i64>) -> () loc(#loc250)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 11, -2, 7, 6, -3, 8, 0, -4, 10, 9, 1, 2], group_type = 0 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x36x32x32xf16, 687194939392 : i64>, tensor<1x42x32x32xf16, 687194853376 : i64>) -> (tensor<1x42x32x32xf16, 687194767360 : i64>, tensor<1x42x16x16xf16, 687195013120 : i64>) loc(#loc250)
      %33 = "tpu.Pad"(%32#1, %0, %0, %0, %0) {mode = #tpu<Pad_Mode constant>, paddings = [0, 0, 0, 0, 0, 6, 0, 0], val = 0.000000e+00 : f64, with_insert_zero = false} : (tensor<1x42x16x16xf16, 687195013120 : i64>, none, none, none, none) -> tensor<1x48x16x16xf16, 687194877952 : i64> loc(#loc78)
      %34 = "top.Weight"() : () -> tensor<1x42x3x3xf16, 618475380736 : i64> loc(#loc79)
      %35 = "top.Weight"() : () -> tensor<1x42x1x1xf16, 618475384832 : i64> loc(#loc80)
      %36 = "top.Weight"() : () -> tensor<1x48x1x1xf32, 618475388928 : i64> loc(#loc81)
      %37 = "top.Weight"() : () -> tensor<1x48x1x48xf16, 618475393024 : i64> loc(#loc82)
      %38 = "tpu.Group"(%32#0, %33) ({
        %113 = "tpu.Load"(%32#0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [32], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x42x32x32xf16, 687194767360 : i64>) -> tensor<1x42x32x32xf16> loc(#loc84)
        %114 = "tpu.Load"(%34) {do_bcast = false, ginfo = #tpu.lg<out_addr = 40960, out_size = 36, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [3], w_idx = [0], w_slice = [3], id = 1, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x42x3x3xf16, 618475380736 : i64>) -> tensor<1x42x3x3xf16> loc(#loc85)
        %115 = "tpu.Load"(%35) {do_bcast = false, ginfo = #tpu.lg<out_addr = 57344, out_size = 4, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x42x1x1xf16, 618475384832 : i64>) -> tensor<1x42x1x1xf16> loc(#loc86)
        %116 = "tpu.Load"(%37) {do_bcast = false, ginfo = #tpu.lg<out_addr = 33792, out_size = 192, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [48], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [48], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x48x1x48xf16, 618475393024 : i64>) -> tensor<1x48x1x48xf16> loc(#loc87)
        %117 = "tpu.Load"(%36) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 8, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [48], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x48x1x1xf32, 618475388928 : i64>) -> tensor<1x48x1x1xf32> loc(#loc88)
        %118 = "tpu.Conv2D"(%113, %114, %115) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 1024, buffer_addr = 16384, buffer_size = 4118, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [42], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [16], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 42 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [0, 0, 2, 2], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x42x32x32xf16>, tensor<1x42x3x3xf16>, tensor<1x42x1x1xf16>) -> tensor<1x42x16x16xf16> loc(#loc89)
        %119 = "tpu.Load"(%33) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 1024, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [48], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [16], id = 6, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x48x16x16xf16, 687194877952 : i64>) -> tensor<1x48x16x16xf16> loc(#loc90)
        %120 = "tpu.Conv2D"(%118, %116, %117) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 1024, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [48], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [16], id = 7, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multicore = true, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x42x16x16xf16>, tensor<1x48x1x48xf16>, tensor<1x48x1x1xf32>) -> tensor<1x48x16x16xf16> loc(#loc91)
