module attributes {module.chip = "BM1686", module.name = "resnet18", module.state = "TPU_QUANTIED", module.weight_file = "resnet18_tpu_quantied_bm1686_weight.npz"} {
  func @main(%arg0: tensor<4x3x224x224xf32>) -> tensor<4x1000xf32> {
    %0 = "top.Input"(%arg0) {name = "input"} : (tensor<4x3x224x224xf32>) -> tensor<4x3x224x224x!quant.calibrated<f32<-2.0665298000000001:2.6400003000000001>>>
    %1 = "tpu.Cast"(%0) {name = "input_to_int8"} : (tensor<4x3x224x224x!quant.calibrated<f32<-2.0665298000000001:2.6400003000000001>>>) -> tensor<4x3x224x224x!quant.uniform<i8:f32, 0.018456980784313726:-127>>
    %2 = "top.Weight"() {name = "125_Relu_filter_int8"} : () -> tensor<64x3x7x7xsi8>
    %3 = "top.Weight"() {name = "125_Relu_bias_int32"} : () -> tensor<64xi32>
    %4 = "tpu.Conv"(%1, %2, %3) {dilations = [1, 1], do_relu = true, group = 1 : i64, kernel_shape = [7, 7], multiplier = [1028319, 510099, 115, 556589, 115, 1303033, 1336373, 115, 2274655, 115, 1067433, 3413, 209051, 115, 62735, 2236531, 3023, 78125, 453215, 251945, 660949, 123693, 45891, 1120191, 1128727, 179417, 62239, 194773, 891589, 616695, 1556987, 346591, 51489, 496529, 279121, 415933, 115, 54125, 115, 529895, 3272947, 858677, 415841, 455149, 1178895, 27103, 192025, 1250091, 115, 1824781, 1767223, 24945, 375613, 1545471, 63703, 581983, 616047, 278595, 710613, 1830117, 1487615, 421, 411215, 1443655], name = "125_Relu", pads = [3, 3, 3, 3], rshift = [29, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 22, 29, 30, 28, 30, 23, 29, 29, 30, 30, 30, 27, 29, 28, 29, 28, 29, 30, 29, 30, 29, 27, 29, 29, 30, 30, 27, 30, 27, 30, 29, 28, 29, 30, 26, 30, 29, 30, 30, 29, 24, 29, 29, 29, 28, 30, 30, 30, 30, 30, 22, 30, 30], strides = [2, 2], with_bias = true} : (tensor<4x3x224x224x!quant.uniform<i8:f32, 0.018456980784313726:-127>>, tensor<64x3x7x7xsi8>, tensor<64xi32>) -> tensor<4x64x112x112x!quant.uniform<u8:f32, 0.013613406274509804:-127>>
    %5 = "tpu.MaxPool"(%4) {do_relu = false, kernel_shape = [3, 3], name = "126_MaxPool", pads = [1, 1, 1, 1], strides = [2, 2]} : (tensor<4x64x112x112x!quant.uniform<u8:f32, 0.013613406274509804:-127>>) -> tensor<4x64x56x56x!quant.uniform<u8:f32, 0.013613406274509804:-127>>
    %6 = "top.Weight"() {name = "129_Relu_filter_int8"} : () -> tensor<64x64x3x3xsi8>
    %7 = "top.Weight"() {name = "129_Relu_bias_int32"} : () -> tensor<64xi32>
    %8 = "tpu.Conv"(%5, %6, %7) {dilations = [1, 1], do_relu = true, group = 1 : i64, kernel_shape = [3, 3], multiplier = [5142605, 817777, 3729177, 2872153, 2516377, 1662539, 239469, 43785, 1203009, 703135, 682733, 2473805, 412039, 260169, 214147, 2739219, 807963, 658383, 780381, 142215, 663373, 1343225, 877139, 268359, 585855, 1059505, 856935, 1211911, 444115, 2061389, 1141933, 982863, 2896243, 1575849, 4186737, 340911, 535699, 3008979, 3046329, 1922699, 204033, 1339715, 486285, 1844941, 877647, 2868621, 1567279, 530899, 2754337, 2180775, 695495, 2051469, 727663, 998143, 3807829, 2039251, 681579, 1668451, 771073, 949479, 2541359, 2207539, 1288195, 52715], name = "129_Relu", pads = [1, 1, 1, 1], rshift = [30, 29, 30, 30, 30, 30, 26, 26, 29, 29, 29, 30, 27, 28, 27, 30, 28, 29, 28, 26, 28, 29, 28, 27, 28, 29, 30, 29, 27, 30, 28, 28, 30, 29, 30, 27, 28, 30, 30, 29, 26, 29, 28, 30, 30, 30, 29, 28, 30, 30, 29, 30, 29, 28, 30, 29, 29, 30, 28, 29, 30, 30, 30, 24], strides = [1, 1], with_bias = true} : (tensor<4x64x56x56x!quant.uniform<u8:f32, 0.013613406274509804:-127>>, tensor<64x64x3x3xsi8>, tensor<64xi32>) -> tensor<4x64x56x56x!quant.uniform<u8:f32, 0.0083817827450980396:-127>>
    %9 = "top.Weight"() {name = "130_Conv_filter_int8"} : () -> tensor<64x64x3x3xsi8>
    %10 = "top.Weight"() {name = "130_Conv_bias_int32"} : () -> tensor<64xi32>
    %11 = "tpu.Conv"(%8, %9, %10) {dilations = [1, 1], do_relu = false, group = 1 : i64, kernel_shape = [3, 3], multiplier = [826515, 524219, 233129, 655651, 268655, 5099, 379139, 248337, 1498217, 1264899, 360505, 1806129, 1912501, 1477307, 473771, 829141, 74581, 761147, 1152179, 4989, 1520721, 381239, 810817, 877205, 437005, 525641, 679117, 369487, 1160913, 193645, 510495, 521803, 346309, 1095511, 496257, 381337, 67909, 1630697, 799831, 190731, 1086425, 84711, 901885, 294311, 696655, 378887, 1493253, 47601, 1054973, 12607, 747717, 364705, 385961, 315509, 362471, 599553, 257325, 460315, 276335, 1290885, 798095, 135507, 726225, 1298947], name = "130_Conv", pads = [1, 1, 1, 1], rshift = [30, 30, 29, 29, 30, 22, 30, 28, 30, 30, 30, 30, 30, 30, 29, 30, 27, 29, 30, 23, 30, 29, 30, 30, 30, 30, 30, 29, 30, 28, 29, 29, 29, 30, 30, 30, 26, 30, 30, 28, 30, 28, 30, 28, 30, 30, 30, 26, 30, 23, 29, 29, 30, 29, 28, 30, 28, 29, 28, 30, 30, 29, 29, 29], strides = [1, 1], with_bias = true} : (tensor<4x64x56x56x!quant.uniform<u8:f32, 0.0083817827450980396:-127>>, tensor<64x64x3x3xsi8>, tensor<64xi32>) -> tensor<4x64x56x56x!quant.uniform<i8:f32, 0.021025304313725488:-127>>
    %12 = "tpu.Add"(%11, %5) {coeff = [8.700000e+01, 1.130000e+02], do_relu = true, name = "133_Relu", rshifts = [6, 7]} : (tensor<4x64x56x56x!quant.uniform<i8:f32, 0.021025304313725488:-127>>, tensor<4x64x56x56x!quant.uniform<u8:f32, 0.013613406274509804:-127>>) -> tensor<4x64x56x56x!quant.uniform<u8:f32, 0.015394971764705882:-127>>
    %13 = "top.Weight"() {name = "136_Relu_filter_int8"} : () -> tensor<64x64x3x3xsi8>
    %14 = "top.Weight"() {name = "136_Relu_bias_int32"} : () -> tensor<64xi32>
    %15 = "tpu.Conv"(%12, %13, %14) {dilations = [1, 1], do_relu = true, group = 1 : i64, kernel_shape = [3, 3], multiplier = [178111, 1726837, 1547029, 159663, 1292223, 2110453, 74407, 953241, 335429, 189009, 579929, 1009677, 540157, 388185, 1971567, 2320537, 3626741, 811473, 904569, 2340851, 1341165, 583859, 1292845, 1757405, 2551697, 62285, 1569867, 466499, 1198799, 1941793, 1072897, 2263985, 2160925, 1257881, 1441597, 1466423, 421685, 438899, 393589, 19613, 1714079, 817683, 486543, 439149, 653675, 1485443, 1616399, 1464311, 920031, 582907, 204563, 119801, 788233, 440291, 450283, 795431, 888779, 2252607, 325279, 2186043, 444983, 1000647, 37401, 1679585], name = "136_Relu", pads = [1, 1, 1, 1], rshift = [27, 29, 30, 27, 29, 30, 26, 28, 27, 26, 29, 30, 28, 27, 30, 30, 30, 29, 30, 30, 30, 29, 30, 30, 30, 25, 30, 29, 30, 30, 30, 30, 30, 29, 30, 30, 28, 28, 28, 24, 30, 29, 29, 28, 29, 30, 30, 29, 29, 28, 26, 26, 29, 28, 28, 28, 29, 30, 28, 30, 28, 30, 24, 30], strides = [1, 1], with_bias = true} : (tensor<4x64x56x56x!quant.uniform<u8:f32, 0.015394971764705882:-127>>, tensor<64x64x3x3xsi8>, tensor<64xi32>) -> tensor<4x64x56x56x!quant.uniform<u8:f32, 0.0095566188235294107:-127>>
    %16 = "top.Weight"() {name = "137_Conv_filter_int8"} : () -> tensor<64x64x3x3xsi8>
    %17 = "top.Weight"() {name = "137_Conv_bias_int32"} : () -> tensor<64xi32>
    %18 = "tpu.Conv"(%15, %16, %17) {dilations = [1, 1], do_relu = false, group = 1 : i64, kernel_shape = [3, 3], multiplier = [472159, 1113871, 584929, 455989, 110335, 1468423, 760915, 1509441, 588613, 201051, 76209, 1037987, 899381, 299677, 507527, 47539, 417011, 1354525, 604279, 98705, 1064539, 55105, 108347, 327535, 374983, 158089, 352743, 191111, 1279521, 594203, 746697, 171327, 1337453, 74421, 425147, 318179, 301243, 175685, 1295139, 182549, 2855, 242797, 290047, 160243, 248635, 417599, 181651, 192525, 936367, 2118247, 899351, 407297, 472887, 113293, 225763, 181157, 117809, 286277, 1577, 704369, 301225, 57089, 425767, 473617], name = "137_Conv", pads = [1, 1, 1, 1], rshift = [30, 30, 30, 29, 29, 30, 30, 30, 29, 28, 28, 30, 29, 29, 30, 26, 29, 30, 29, 28, 30, 27, 27, 29, 30, 30, 30, 29, 30, 30, 30, 28, 30, 27, 30, 30, 28, 28, 30, 28, 21, 30, 29, 28, 29, 30, 28, 29, 30, 30, 30, 30, 28, 29, 28, 29, 28, 30, 21, 30, 30, 29, 29, 29], strides = [1, 1], with_bias = true} : (tensor<4x64x56x56x!quant.uniform<u8:f32, 0.0095566188235294107:-127>>, tensor<64x64x3x3xsi8>, tensor<64xi32>) -> tensor<4x64x56x56x!quant.uniform<i8:f32, 0.039951460784313726:-127>>
    %19 = "tpu.Add"(%18, %12) {coeff = [2.300000e+01, 7.100000e+01], do_relu = true, name = "140_Relu", rshifts = [4, 7]} : (tensor<4x64x56x56x!quant.uniform<i8:f32, 0.039951460784313726:-127>>, tensor<4x64x56x56x!quant.uniform<u8:f32, 0.015394971764705882:-127>>) -> tensor<4x64x56x56x!quant.uniform<u8:f32, 0.027799198823529412:-127>>
    %20 = "top.Weight"() {name = "143_Relu_filter_int8"} : () -> tensor<128x64x3x3xsi8>
    %21 = "top.Weight"() {name = "143_Relu_bias_int32"} : () -> tensor<128xi32>
    %22 = "tpu.Conv"(%19, %20, %21) {dilations = [1, 1], do_relu = true, group = 1 : i64, kernel_shape = [3, 3], multiplier = [1093495, 2325385, 911143, 1591163, 1126083, 3111343, 656573, 2701531, 2212109, 1288459, 966753, 864079, 3117729, 355775, 1311231, 557007, 3266481, 1998993, 2943063, 174863, 2554435, 1140495, 3219489, 3523559, 302647, 751779, 3118975, 2531805, 497935, 388761, 464953, 2840775, 1559421, 1122225, 17991, 3184191, 2451743, 2822047, 2096025, 2112823, 2505969, 103399, 1542241, 2529445, 744301, 750605, 1997755, 202063, 838565, 3841005, 89919, 2210617, 698167, 388127, 266185, 2339957, 857687, 1408751, 239545, 2632107, 1489451, 1134359, 1495907, 1993525, 1289429, 311667, 1202085, 143143, 2192053, 886237, 1670555, 1758961, 2607965, 2401469, 1546561, 3031679, 728041, 135903, 1996417, 2099727, 1391703, 3100553, 167953, 335165, 1228961, 1974037, 1502557, 533579, 1850561, 1216585, 371095, 340627, 1451703, 3223133, 1198013, 1106523, 66123, 1360257, 2255607, 2545017, 2708799, 733323, 2770815, 1754137, 702013, 935913, 3073543, 192751, 3350511, 2387413, 4134447, 1378233, 3669445, 1419205, 795801, 1767243, 3369599, 2268683, 1276395, 2672979, 1512297, 3080801, 480511, 407905, 1782323, 1908379, 597633, 3524563], name = "143_Relu", pads = [1, 1, 1, 1], rshift = [29, 30, 29, 30, 29, 30, 29, 30, 30, 29, 28, 29, 30, 28, 30, 28, 30, 30, 30, 26, 30, 29, 30, 30, 27, 28, 30, 30, 27, 28, 28, 30, 30, 29, 23, 30, 30, 30, 30, 30, 30, 25, 28, 30, 29, 29, 30, 26, 29, 30, 25, 30, 28, 28, 27, 30, 29, 30, 27, 29, 30, 29, 30, 30, 30, 27, 29, 26, 30, 28, 29, 30, 30, 30, 29, 30, 28, 26, 30, 30, 29, 30, 26, 27, 29, 30, 29, 28, 30, 29, 27, 28, 29, 30, 30, 29, 25, 30, 30, 30, 30, 28, 30, 30, 29, 29, 30, 27, 30, 30, 30, 29, 30, 30, 29, 29, 30, 30, 29, 30, 30, 30, 28, 27, 29, 30, 28, 30], strides = [2, 2], with_bias = true} : (tensor<4x64x56x56x!quant.uniform<u8:f32, 0.027799198823529412:-127>>, tensor<128x64x3x3xsi8>, tensor<128xi32>) -> tensor<4x128x28x28x!quant.uniform<u8:f32, 0.0081035454901960784:-127>>
    %23 = "top.Weight"() {name = "144_Conv_filter_int8"} : () -> tensor<128x128x3x3xsi8>
    %24 = "top.Weight"() {name = "144_Conv_bias_int32"} : () -> tensor<128xi32>
    %25 = "tpu.Conv"(%22, %23, %24) {dilations = [1, 1], do_relu = false, group = 1 : i64, kernel_shape = [3, 3], multiplier = [154339, 416965, 320695, 78417, 622285, 357639, 662757, 340637, 303429, 232307, 279497, 75515, 225343, 591169, 241207, 287243, 431457, 615803, 134645, 423125, 1388807, 631485, 208337, 286709, 64043, 10911, 501773, 348163, 34151, 153419, 133507, 134825, 439985, 42199, 215979, 531573, 299975, 192935, 340423, 469329, 259693, 14587, 178273, 267251, 311479, 203525, 253299, 141621, 691753, 945105, 150009, 223297, 347111, 139325, 203075, 153521, 156587, 36045, 283205, 464185, 286611, 147765, 500093, 498659, 619615, 986957, 70323, 30807, 52839, 41039, 222611, 1217433, 297077, 205563, 176629, 353765, 480375, 307695, 38735, 733193, 115745, 71417, 515821, 205507, 247939, 23771, 537081, 14931, 521627, 960915, 302593, 746397, 479477, 283317, 495047, 165901, 265849, 230115, 381953, 401687, 199109, 114493, 610917, 606113, 810403, 114291, 157945, 351765, 809275, 365891, 648545, 762903, 833625, 313979, 329075, 304611, 603073, 341585, 136819, 131907, 820151, 78931, 574849, 776017, 58383, 703387, 104827, 452861], name = "144_Conv", pads = [1, 1, 1, 1], rshift = [29, 30, 29, 28, 30, 29, 30, 30, 29, 30, 30, 27, 29, 30, 30, 30, 30, 30, 29, 30, 30, 30, 30, 28, 28, 25, 30, 30, 27, 29, 28, 28, 30, 27, 29, 30, 30, 29, 29, 30, 29, 26, 29, 30, 30, 29, 29, 28, 30, 30, 29, 28, 30, 29, 29, 29, 29, 27, 29, 30, 29, 28, 29, 30, 30, 30, 27, 26, 27, 26, 29, 30, 28, 29, 29, 30, 30, 30, 27, 30, 28, 27, 30, 30, 29, 27, 30, 24, 30, 30, 30, 29, 30, 29, 30, 28, 30, 30, 29, 30, 28, 29, 30, 30, 30, 28, 29, 30, 30, 30, 30, 30, 30, 28, 30, 29, 30, 29, 28, 29, 30, 29, 30, 30, 27, 29, 29, 29], strides = [1, 1], with_bias = true} : (tensor<4x128x28x28x!quant.uniform<u8:f32, 0.0081035454901960784:-127>>, tensor<128x128x3x3xsi8>, tensor<128xi32>) -> tensor<4x128x28x28x!quant.uniform<i8:f32, 0.033235318823529411:-127>>
    %26 = "top.Weight"() {name = "146_Conv_filter_int8"} : () -> tensor<128x64x1x1xsi8>
    %27 = "top.Weight"() {name = "146_Conv_bias_int32"} : () -> tensor<128xi32>
    %28 = "tpu.Conv"(%19, %26, %27) {dilations = [1, 1], do_relu = false, group = 1 : i64, kernel_shape = [1, 1], multiplier = [1209739, 327565, 239877, 5264783, 1475649, 1442475, 1002269, 1819499, 914673, 316201, 3204417, 2697411, 286185, 1313077, 2073619, 356753, 1945777, 1575061, 4347121, 688911, 8365747, 592621, 626597, 429129, 750533, 410603, 498089, 1338839, 1739829, 2289109, 1808395, 281127, 5249669, 3457037, 1546371, 6060341, 1463931, 1471123, 2796073, 1099151, 1536809, 1733575, 1861609, 1265963, 1111677, 1784211, 1000153, 354203, 415731, 2646911, 2980731, 339445, 24171, 2765547, 1204611, 1039669, 719691, 5884261, 122657, 2467211, 641501, 830249, 1667539, 513599, 581915, 653905, 137033, 141949, 510279, 859723, 2944713, 1204515, 1212419, 225663, 1587785, 776841, 620589, 86465, 5888023, 2146179, 796003, 1447451, 104025, 1277283, 1090067, 3603791, 1718105, 2210691, 1443763, 1392193, 3652111, 1552731, 716181, 1305575, 4769327, 1589391, 218939, 618743, 754393, 1005307, 2664759, 959747, 365695, 2804783, 452455, 1629027, 90753, 614461, 574201, 458015, 1233773, 668889, 3821617, 890477, 4248295, 1296061, 3328217, 943259, 209057, 3023459, 335001, 2937931, 236911, 35453, 37815, 1036217, 8788363, 1409475], name = "146_Conv", pads = [0, 0, 0, 0], rshift = [28, 29, 28, 30, 30, 30, 29, 29, 29, 27, 29, 30, 26, 30, 29, 27, 30, 30, 30, 30, 30, 30, 27, 29, 28, 30, 28, 28, 29, 29, 30, 29, 30, 30, 28, 30, 30, 28, 30, 29, 30, 29, 29, 29, 28, 29, 28, 28, 30, 30, 29, 28, 25, 29, 30, 28, 28, 30, 27, 30, 29, 28, 30, 30, 30, 30, 27, 27, 29, 30, 30, 30, 30, 28, 30, 30, 30, 28, 30, 30, 28, 30, 27, 29, 29, 29, 30, 30, 30, 30, 30, 29, 28, 30, 30, 30, 28, 28, 29, 29, 30, 28, 27, 30, 26, 30, 27, 30, 30, 28, 30, 29, 30, 30, 30, 30, 30, 29, 28, 30, 30, 30, 27, 30, 24, 30, 30, 30], strides = [2, 2], with_bias = true} : (tensor<4x64x56x56x!quant.uniform<u8:f32, 0.027799198823529412:-127>>, tensor<128x64x1x1xsi8>, tensor<128xi32>) -> tensor<4x128x28x28x!quant.uniform<i8:f32, 0.018513302745098038:-127>>
    %29 = "tpu.Add"(%25, %28) {coeff = [4.100000e+01, 9.100000e+01], do_relu = true, name = "149_Relu", rshifts = [5, 7]} : (tensor<4x128x28x28x!quant.uniform<i8:f32, 0.033235318823529411:-127>>, tensor<4x128x28x28x!quant.uniform<i8:f32, 0.018513302745098038:-127>>) -> tensor<4x128x28x28x!quant.uniform<u8:f32, 0.02609824588235294:-127>>
    %30 = "top.Weight"() {name = "152_Relu_filter_int8"} : () -> tensor<128x128x3x3xsi8>
    %31 = "top.Weight"() {name = "152_Relu_bias_int32"} : () -> tensor<128xi32>
    %32 = "tpu.Conv"(%29, %30, %31) {dilations = [1, 1], do_relu = true, group = 1 : i64, kernel_shape = [3, 3], multiplier = [2136817, 1534197, 715767, 1148281, 1095479, 173609, 1054141, 3062507, 1765131, 1064495, 391541, 1785139, 1512145, 2180199, 1176335, 982751, 1185685, 55161, 1779135, 1569313, 2547137, 80219, 227909, 1364397, 961469, 1068805, 1266551, 3286255, 2917019, 2030445, 1521877, 1095889, 81359, 1918349, 560247, 2008183, 2525569, 148437, 1114129, 1068301, 688403, 1798213, 2299631, 552973, 2283779, 1964953, 3345209, 614929, 1732911, 1503747, 1992157, 2804097, 704443, 1079927, 682801, 1134719, 1065057, 1769237, 855365, 2147107, 499323, 1082229, 1830019, 117649, 480471, 1773595, 1608613, 431375, 104981, 1317821, 332531, 2798927, 1811931, 200067, 1233107, 304621, 1251993, 2025151, 671261, 1435723, 1009633, 822077, 571811, 1165359, 702591, 1838843, 567677, 1879881, 4052145, 2142127, 671551, 707219, 1866727, 1151971, 195281, 768413, 1374237, 992043, 1845887, 428475, 1998475, 417885, 498291, 3865035, 467273, 1394471, 1734885, 351899, 80065, 2354259, 898967, 1592929, 1839603, 275805, 1475535, 254265, 417561, 1567527, 2128285, 1568491, 891635, 529799, 1461397, 710795, 715353, 2155217, 2249461, 1491475], name = "152_Relu", pads = [1, 1, 1, 1], rshift = [30, 30, 29, 30, 29, 27, 30, 30, 30, 29, 28, 30, 30, 30, 30, 28, 29, 25, 30, 30, 30, 26, 27, 30, 30, 29, 29, 30, 30, 30, 30, 29, 27, 30, 29, 30, 30, 27, 29, 29, 28, 30, 30, 28, 30, 30, 30, 28, 30, 29, 29, 30, 29, 29, 28, 29, 29, 30, 29, 30, 28, 29, 30, 26, 29, 30, 30, 28, 26, 30, 27, 30, 30, 27, 30, 27, 30, 30, 29, 29, 30, 29, 28, 30, 29, 30, 29, 30, 30, 30, 29, 29, 30, 29, 27, 28, 30, 30, 29, 28, 30, 28, 28, 30, 28, 30, 30, 28, 26, 30, 29, 30, 30, 28, 30, 28, 28, 30, 30, 30, 29, 28, 30, 29, 29, 30, 30, 30], strides = [1, 1], with_bias = true} : (tensor<4x128x28x28x!quant.uniform<u8:f32, 0.02609824588235294:-127>>, tensor<128x128x3x3xsi8>, tensor<128xi32>) -> tensor<4x128x28x28x!quant.uniform<u8:f32, 0.016937667058823529:-127>>
    %33 = "top.Weight"() {name = "153_Conv_filter_int8"} : () -> tensor<128x128x3x3xsi8>
    %34 = "top.Weight"() {name = "153_Conv_bias_int32"} : () -> tensor<128xi32>
    %35 = "tpu.Conv"(%32, %33, %34) {dilations = [1, 1], do_relu = false, group = 1 : i64, kernel_shape = [3, 3], multiplier = [494041, 433083, 1155861, 1484507, 1017521, 320749, 1159659, 632433, 950781, 609065, 953439, 361313, 738035, 506487, 172493, 357393, 729463, 1092373, 6703, 830895, 106581, 1569087, 141243, 2004303, 11077, 1266827, 897569, 221645, 9873, 765141, 86721, 1462867, 908785, 800347, 1626001, 1802801, 1069089, 955103, 553091, 566861, 53895, 39523, 404179, 25337, 291941, 245367, 692869, 607083, 1197153, 1208899, 173647, 609653, 1134521, 740853, 577871, 625993, 617147, 257459, 1114279, 700647, 629031, 503439, 1650395, 75423, 163873, 621903, 217347, 112899, 54769, 289011, 1368653, 779657, 356833, 1611305, 55923, 1366707, 2392451, 644621, 618873, 439605, 830767, 640835, 305865, 51841, 380439, 164415, 236297, 447539, 883589, 597019, 949019, 1405785, 2296667, 574267, 880139, 967427, 169861, 405403, 1791073, 609817, 846187, 594803, 503353, 409489, 2017659, 1127103, 32829, 175699, 556087, 1277375, 921475, 38951, 457779, 628023, 906015, 1499751, 1128029, 476535, 1055211, 330275, 125811, 159439, 267137, 3443, 496495, 167835, 668883, 1438119], name = "153_Conv", pads = [1, 1, 1, 1], rshift = [30, 30, 30, 30, 30, 28, 30, 30, 30, 30, 30, 29, 30, 29, 28, 29, 30, 30, 24, 30, 27, 30, 28, 30, 23, 30, 30, 28, 24, 30, 27, 30, 30, 30, 30, 29, 30, 30, 30, 30, 27, 26, 28, 26, 29, 29, 30, 30, 30, 30, 28, 28, 30, 30, 30, 30, 30, 29, 30, 30, 29, 29, 30, 27, 28, 30, 29, 27, 26, 27, 30, 29, 28, 30, 27, 30, 30, 30, 30, 28, 30, 30, 30, 26, 29, 29, 28, 29, 29, 30, 30, 30, 30, 30, 30, 30, 28, 30, 30, 30, 30, 30, 30, 29, 30, 30, 25, 29, 29, 30, 30, 26, 29, 28, 30, 30, 30, 29, 29, 29, 28, 30, 28, 23, 28, 27, 30, 30], strides = [1, 1], with_bias = true} : (tensor<4x128x28x28x!quant.uniform<u8:f32, 0.016937667058823529:-127>>, tensor<128x128x3x3xsi8>, tensor<128xi32>) -> tensor<4x128x28x28x!quant.uniform<i8:f32, 0.034834562745098038:-127>>
    %36 = "tpu.Add"(%35, %29) {coeff = [5.000000e+00, 1.500000e+01], do_relu = true, name = "156_Relu", rshifts = [2, 4]} : (tensor<4x128x28x28x!quant.uniform<i8:f32, 0.034834562745098038:-127>>, tensor<4x128x28x28x!quant.uniform<u8:f32, 0.02609824588235294:-127>>) -> tensor<4x128x28x28x!quant.uniform<u8:f32, 0.027860557254901962:-127>>
    %37 = "top.Weight"() {name = "159_Relu_filter_int8"} : () -> tensor<256x128x3x3xsi8>
    %38 = "top.Weight"() {name = "159_Relu_bias_int32"} : () -> tensor<256xi32>
    %39 = "tpu.Conv"(%36, %37, %38) {dilations = [1, 1], do_relu = true, group = 1 : i64, kernel_shape = [3, 3], multiplier = [112119, 280273, 645269, 1954081, 1098437, 692437, 822791, 651541, 898901, 641509, 219447, 1687379, 585569, 73185, 1324749, 2315703, 1859513, 383851, 1632243, 677183, 440459, 1610101, 300411, 835021, 720847, 1716785, 982237, 579953, 4252031, 599667, 830061, 971609, 78283, 653323, 917787, 1669895, 1347183, 525357, 284873, 1000879, 2000903, 1428771, 430609, 2140933, 2090317, 1490927, 2346495, 1357915, 1428087, 839027, 119831, 141057, 1072561, 1678819, 1254935, 438005, 149309, 27759, 1316809, 1737575, 1800461, 1993385, 1139433, 1076479, 2292015, 1350165, 2003971, 3623041, 1421557, 664027, 1443201, 1803643, 1010159, 465181, 347717, 1551935, 865549, 2048025, 2741701, 1422365, 1277445, 882997, 3171811, 1321143, 636705, 321787, 105515, 1300895, 608997, 1469481, 983787, 848377, 2274803, 1613769, 2937571, 1731769, 1474703, 287283, 7503, 236485, 1540263, 1966873, 379815, 184621, 1977417, 1407697, 471331, 1727953, 674623, 1119943, 1634369, 1325155, 2652975, 479335, 1339645, 875003, 1820229, 640107, 2040203, 1460483, 149973, 1960663, 1426195, 1043635, 1588581, 1647601, 410249, 329113, 1458539, 1646793, 723227, 751361, 196435, 2481473, 1222945, 1757475, 906829, 1984303, 224443, 474859, 154065, 999891, 1666881, 467575, 519163, 1390209, 1368685, 2402205, 1979959, 728107, 2370523, 1442447, 339559, 1626901, 910305, 2995175, 779789, 2289211, 1543499, 1545903, 434939, 883349, 257113, 2064697, 760217, 1607943, 704027, 1396025, 50803, 2482467, 1825403, 747551, 1727409, 733195, 1306917, 391951, 602809, 1429119, 1221, 649999, 1367925, 519039, 1128371, 15981, 2554703, 1533903, 674057, 1238209, 1390375, 445485, 474235, 2433, 959709, 2798761, 1700637, 291573, 253859, 1096393, 452857, 2174539, 1829699, 454091, 630917, 454579, 1711301, 1223409, 656717, 1616827, 1338127, 3402601, 1842219, 3355805, 1588045, 1103171, 411501, 249683, 1189459, 2669861, 2256497, 1005019, 1396181, 1190135, 578615, 478623, 1456377, 1055803, 1897895, 2306727, 791687, 224395, 105705, 851173, 82973, 1194751, 600099, 1150179, 2436977, 2038575, 7441, 1366001, 1557011, 845371, 764057, 1584169, 1508623, 2756123, 1003477, 2043975, 1305297, 1794137, 1296067, 1443663, 729281, 1544581, 108225, 930597], name = "159_Relu", pads = [1, 1, 1, 1], rshift = [26, 27, 29, 30, 30, 29, 29, 29, 29, 29, 27, 29, 29, 26, 30, 30, 30, 28, 29, 29, 28, 30, 28, 29, 29, 30, 29, 28, 30, 29, 29, 29, 26, 29, 29, 30, 30, 28, 28, 29, 30, 30, 28, 30, 30, 30, 30, 30, 30, 29, 26, 26, 29, 30, 29, 28, 26, 24, 29, 30, 30, 30, 29, 29, 30, 30, 30, 30, 30, 28, 30, 29, 29, 28, 27, 30, 29, 30, 30, 30, 29, 29, 30, 29, 29, 27, 26, 30, 29, 30, 29, 29, 30, 29, 30, 30, 30, 28, 23, 27, 29, 30, 28, 27, 30, 30, 28, 30, 29, 29, 30, 29, 30, 28, 30, 29, 29, 29, 30, 30, 27, 30, 30, 29, 29, 30, 28, 28, 30, 30, 29, 29, 27, 30, 30, 30, 29, 30, 28, 28, 26, 29, 30, 28, 29, 30, 30, 30, 30, 29, 30, 30, 28, 30, 29, 30, 29, 30, 30, 30, 28, 29, 27, 30, 29, 29, 29, 30, 25, 30, 30, 29, 30, 29, 29, 28, 29, 29, 19, 29, 30, 28, 29, 23, 30, 30, 29, 29, 30, 27, 28, 21, 29, 30, 30, 28, 27, 30, 28, 30, 30, 29, 28, 28, 30, 30, 28, 30, 29, 30, 30, 30, 30, 29, 28, 27, 30, 30, 30, 30, 30, 30, 29, 28, 29, 29, 30, 30, 29, 27, 26, 29, 26, 30, 28, 29, 30, 30, 23, 30, 30, 29, 29, 29, 30, 30, 29, 29, 29, 29, 30, 30, 29, 30, 26, 30], strides = [2, 2], with_bias = true} : (tensor<4x128x28x28x!quant.uniform<u8:f32, 0.027860557254901962:-127>>, tensor<256x128x3x3xsi8>, tensor<256xi32>) -> tensor<4x256x14x14x!quant.uniform<u8:f32, 0.013058133333333333:-127>>
    %40 = "top.Weight"() {name = "160_Conv_filter_int8"} : () -> tensor<256x256x3x3xsi8>
    %41 = "top.Weight"() {name = "160_Conv_bias_int32"} : () -> tensor<256xi32>
    %42 = "tpu.Conv"(%39, %40, %41) {dilations = [1, 1], do_relu = false, group = 1 : i64, kernel_shape = [3, 3], multiplier = [564337, 315431, 179661, 141251, 270233, 288025, 865387, 458743, 586267, 429743, 191285, 108653, 305911, 369683, 823063, 431785, 610743, 1202249, 679545, 409637, 129093, 505197, 254841, 496829, 622725, 1016601, 710979, 840537, 205967, 247503, 74197, 446995, 441347, 386041, 434319, 511661, 1371011, 794193, 158677, 924747, 161733, 69341, 458753, 390823, 678721, 206673, 429085, 832141, 49085, 1581113, 867687, 284181, 11647, 180731, 297769, 421903, 611535, 181477, 474995, 404347, 809933, 325685, 363329, 200365, 712947, 578291, 451109, 261379, 374667, 62345, 36535, 195401, 919445, 460513, 241609, 192561, 1054835, 572661, 455937, 197451, 940775, 217909, 371717, 70185, 293445, 447499, 558457, 770853, 1299687, 335011, 252731, 623055, 894045, 518555, 342135, 232561, 685081, 112431, 180431, 255301, 1305533, 676623, 503931, 75877, 434323, 375481, 377671, 345643, 440375, 354853, 468203, 178177, 156217, 374555, 460147, 121433, 3125, 128679, 354401, 251731, 910667, 374855, 465827, 526801, 405817, 319477, 106169, 1336979, 651119, 184681, 192281, 957111, 19323, 779141, 913105, 899381, 234357, 1964453, 40165, 400279, 511269, 1613817, 480007, 633245, 208799, 1488965, 19153, 587321, 850623, 929033, 1384355, 303913, 727375, 24219, 527047, 308713, 55175, 81579, 57025, 299321, 1595371, 105127, 462431, 332051, 455075, 27003, 537603, 817881, 390423, 449587, 312489, 67423, 201065, 636177, 311009, 153401, 269745, 601425, 812881, 853477, 187141, 776857, 761869, 176795, 561735, 222687, 401671, 963093, 117857, 494897, 349833, 532319, 33261, 712927, 161053, 161213, 58701, 265035, 916531, 1190837, 580171, 867581, 27131, 840409, 2094449, 1473125, 367291, 1186377, 34383, 316945, 207505, 788125, 568617, 148455, 72393, 488561, 366897, 313325, 672241, 1611825, 415701, 552923, 333485, 1006833, 55315, 135687, 601969, 314355, 750281, 917175, 29979, 229007, 778705, 592441, 530245, 442553, 933979, 562183, 65909, 444777, 114181, 1737085, 504995, 216153, 91213, 772615, 647077, 705531, 825979, 65099, 209575, 890201, 127299, 697851, 692361, 959651], name = "160_Conv", pads = [1, 1, 1, 1], rshift = [30, 30, 29, 27, 29, 29, 30, 30, 30, 30, 29, 28, 29, 29, 30, 30, 30, 30, 30, 30, 27, 30, 29, 29, 30, 30, 30, 29, 28, 28, 27, 30, 30, 30, 30, 30, 30, 30, 29, 30, 28, 27, 30, 30, 30, 29, 30, 30, 26, 30, 30, 28, 25, 29, 29, 30, 29, 29, 30, 30, 30, 30, 29, 29, 30, 30, 29, 28, 29, 26, 26, 29, 30, 30, 27, 29, 30, 30, 30, 29, 30, 29, 29, 27, 29, 30, 29, 30, 30, 30, 29, 29, 29, 30, 30, 29, 30, 28, 29, 28, 30, 30, 30, 27, 30, 28, 30, 28, 29, 30, 30, 29, 28, 29, 29, 28, 22, 26, 28, 29, 29, 29, 29, 29, 29, 30, 28, 30, 29, 28, 28, 30, 26, 30, 30, 30, 29, 30, 26, 29, 30, 30, 30, 30, 29, 30, 25, 30, 29, 30, 30, 29, 30, 24, 29, 29, 26, 28, 27, 29, 30, 28, 29, 30, 29, 25, 29, 29, 29, 30, 28, 27, 29, 28, 29, 27, 29, 30, 30, 30, 28, 30, 30, 28, 29, 29, 30, 30, 28, 29, 30, 30, 26, 30, 28, 28, 27, 29, 30, 30, 30, 29, 26, 30, 30, 30, 30, 30, 26, 29, 29, 30, 30, 28, 26, 29, 29, 30, 30, 30, 30, 30, 29, 30, 26, 27, 29, 28, 30, 30, 26, 29, 30, 30, 29, 30, 30, 30, 27, 30, 28, 30, 29, 29, 28, 30, 29, 30, 29, 27, 28, 30, 28, 30, 30, 30], strides = [1, 1], with_bias = true} : (tensor<4x256x14x14x!quant.uniform<u8:f32, 0.013058133333333333:-127>>, tensor<256x256x3x3xsi8>, tensor<256xi32>) -> tensor<4x256x14x14x!quant.uniform<i8:f32, 0.024465616078431372:-127>>
    %43 = "top.Weight"() {name = "162_Conv_filter_int8"} : () -> tensor<256x128x1x1xsi8>
    %44 = "top.Weight"() {name = "162_Conv_bias_int32"} : () -> tensor<256xi32>
    %45 = "tpu.Conv"(%36, %43, %44) {dilations = [1, 1], do_relu = false, group = 1 : i64, kernel_shape = [1, 1], multiplier = [762955, 528163, 879045, 1960551, 1316699, 154633, 512839, 1671737, 379903, 406237, 322677, 737113, 1729195, 186473, 1749555, 1304419, 680649, 911759, 380333, 18291, 3354817, 1530435, 1235687, 276801, 1827581, 413821, 885937, 402671, 609643, 746541, 129787, 1186587, 422289, 1114537, 603245, 1246553, 271043, 291955, 2088541, 1472209, 3982467, 392031, 1739317, 948397, 3660859, 141925, 49223, 4980313, 483377, 2785201, 3518701, 4646539, 927621, 1017383, 925753, 277565, 2960485, 506003, 167775, 1222005, 2024249, 1004715, 576237, 1737575, 1144725, 767129, 1007249, 243841, 2077575, 388237, 467825, 1141025, 1536367, 1527559, 2421931, 86823, 96751, 566169, 200417, 305, 624893, 1346061, 2419843, 1045061, 751423, 455969, 1595061, 1764665, 1345341, 1328243, 1585473, 696339, 1744663, 783447, 148803, 227785, 1135089, 1500147, 918743, 1008047, 2128335, 1371357, 3806185, 1507057, 761971, 496773, 1085667, 2579267, 2053191, 515783, 1493711, 1053559, 881983, 1810549, 851935, 507923, 249123, 3616301, 736025, 714787, 3053245, 719937, 2116793, 1282919, 1287149, 914531, 607407, 2901091, 703533, 766083, 348697, 97053, 1254257, 1419117, 365127, 790531, 564153, 2292045, 52339, 452087, 508527, 1682091, 814843, 234815, 216633, 975057, 1307615, 1323819, 2324081, 7627, 2073889, 276087, 16311, 1275353, 3309001, 1434201, 700597, 565355, 457913, 1054371, 4934143, 1621447, 1450977, 156013, 502699, 66947, 2739997, 2419597, 1993707, 221527, 2637011, 111985, 2806893, 1613959, 2693613, 502843, 962759, 395081, 1304175, 1205083, 1343911, 1302785, 2971097, 916629, 2171827, 657255, 1651013, 157521, 902039, 1210987, 1335023, 699347, 200881, 1578597, 994819, 1573341, 2862229, 1658875, 1183489, 682951, 1240141, 1940707, 1181675, 2749381, 2522515, 571353, 293875, 986019, 1143199, 1606487, 170239, 2046215, 1956487, 2892375, 1228981, 623177, 458829, 482709, 1334819, 792575, 368851, 1194499, 2410265, 19669, 789323, 1144565, 393165, 1816077, 2259869, 901589, 221843, 162643, 468743, 2258763, 759811, 1372859, 1953693, 84233, 385321, 346613, 446843, 2349555, 2177861, 849267, 470095, 210397, 3426439, 1052387, 20463, 2190831, 923795, 2266759, 1424583, 498569, 1144705, 1184241], name = "162_Conv", pads = [0, 0, 0, 0], rshift = [29, 29, 30, 29, 30, 27, 28, 30, 29, 29, 28, 29, 30, 26, 30, 30, 28, 28, 29, 24, 30, 30, 30, 27, 29, 27, 28, 28, 29, 29, 26, 29, 29, 30, 29, 29, 27, 27, 30, 29, 30, 28, 30, 30, 30, 27, 26, 30, 29, 30, 30, 30, 30, 30, 29, 28, 30, 29, 26, 30, 29, 29, 28, 30, 29, 28, 30, 29, 30, 28, 29, 29, 29, 29, 29, 26, 25, 29, 27, 18, 28, 30, 30, 29, 28, 29, 30, 29, 30, 30, 30, 28, 30, 30, 27, 28, 29, 30, 30, 30, 30, 29, 30, 30, 29, 28, 30, 30, 30, 29, 30, 30, 30, 29, 29, 30, 27, 29, 29, 29, 30, 30, 30, 29, 29, 30, 29, 30, 28, 29, 29, 25, 30, 29, 28, 29, 29, 28, 24, 29, 28, 30, 29, 28, 28, 29, 29, 29, 30, 22, 29, 28, 23, 29, 30, 30, 28, 29, 30, 29, 30, 30, 28, 28, 28, 26, 30, 30, 30, 28, 30, 27, 30, 29, 30, 28, 29, 29, 29, 30, 30, 30, 29, 30, 30, 29, 30, 26, 30, 29, 30, 30, 29, 29, 29, 30, 30, 30, 30, 28, 30, 29, 30, 30, 30, 28, 29, 29, 30, 29, 28, 30, 30, 30, 29, 30, 29, 28, 30, 29, 29, 29, 30, 24, 30, 29, 27, 29, 30, 29, 28, 27, 28, 30, 30, 29, 30, 27, 28, 27, 29, 29, 30, 28, 29, 29, 30, 29, 23, 30, 29, 30, 30, 28, 29, 29], strides = [2, 2], with_bias = true} : (tensor<4x128x28x28x!quant.uniform<u8:f32, 0.027860557254901962:-127>>, tensor<256x128x1x1xsi8>, tensor<256xi32>) -> tensor<4x256x14x14x!quant.uniform<i8:f32, 0.010486596078431373:-127>>
    %46 = "tpu.Add"(%42, %45) {coeff = [1.300000e+01, 8.900000e+01], do_relu = true, name = "165_Relu", rshifts = [3, 7]} : (tensor<4x256x14x14x!quant.uniform<i8:f32, 0.024465616078431372:-127>>, tensor<4x256x14x14x!quant.uniform<i8:f32, 0.010486596078431373:-127>>) -> tensor<4x256x14x14x!quant.uniform<u8:f32, 0.015048952549019607:-127>>
    %47 = "top.Weight"() {name = "168_Relu_filter_int8"} : () -> tensor<256x256x3x3xsi8>
    %48 = "top.Weight"() {name = "168_Relu_bias_int32"} : () -> tensor<256xi32>
    %49 = "tpu.Conv"(%46, %47, %48) {dilations = [1, 1], do_relu = true, group = 1 : i64, kernel_shape = [3, 3], multiplier = [653051, 824293, 883691, 1720725, 455235, 100179, 769007, 360527, 597617, 569439, 105491, 234051, 931417, 200959, 38517, 859751, 1258757, 299369, 1114153, 1290285, 62333, 191741, 204477, 229095, 480221, 22673, 254525, 1426425, 82463, 928399, 559417, 397591, 1436007, 52615, 908403, 708471, 954909, 820119, 630419, 312615, 734921, 1111189, 943685, 880005, 263619, 489663, 158503, 834825, 879471, 701429, 25431, 134237, 771351, 670647, 367379, 760501, 469435, 1024651, 497263, 139893, 634155, 249397, 1075997, 866633, 857071, 1471393, 1746037, 292313, 241537, 347509, 522763, 354145, 466773, 295801, 507579, 174323, 536343, 1893429, 478987, 339737, 374559, 816823, 597557, 294223, 620017, 10941, 157751, 292849, 1671673, 417993, 324823, 179215, 228161, 1023875, 1031615, 961169, 1484797, 1119583, 901621, 138907, 358803, 22595, 349609, 895703, 950777, 803125, 525165, 426131, 970455, 428537, 1490223, 303113, 877059, 545799, 735507, 452933, 865631, 965939, 982259, 149973, 1089523, 319539, 128725, 368945, 503085, 295043, 5693, 406803, 899601, 852359, 274721, 386443, 965883, 1009353, 286777, 865229, 781689, 450491, 350179, 1074807, 331433, 573035, 1442659, 38253, 490855, 780619, 255101, 152817, 78793, 228959, 631741, 951619, 312537, 183211, 711461, 914469, 1094077, 711539, 485611, 67385, 18579, 211451, 486637, 468343, 42527, 1106777, 27759, 489485, 749073, 441931, 652647, 861115, 985339, 666063, 1355935, 646229, 219051, 485841, 1166991, 584501, 295559, 862385, 531175, 1006349, 740043, 811091, 1417369, 444785, 496239, 848963, 93881, 1519185, 1643811, 395119, 733419, 738547, 301405, 789553, 636631, 1642259, 185855, 464389, 1152171, 1050321, 560361, 465113, 1178799, 588877, 260533, 428077, 376423, 1091087, 609197, 674095, 1719215, 113253, 1413903, 1056529, 97643, 2335147, 220091, 1047791, 941177, 473739, 528511, 1284209, 313603, 141527, 997753, 305279, 162151, 1393795, 539439, 517377, 1265021, 154699, 233859, 801827, 639453, 1181239, 952591, 761255, 499851, 388359, 110979, 590617, 665525, 643745, 1049815, 401319, 344891, 293257, 623405, 1084719, 184399, 174065], name = "168_Relu", pads = [1, 1, 1, 1], rshift = [30, 30, 30, 30, 29, 27, 29, 28, 30, 29, 27, 28, 30, 28, 25, 29, 30, 29, 30, 30, 26, 28, 28, 29, 29, 25, 29, 30, 26, 29, 30, 29, 30, 26, 30, 30, 30, 30, 30, 29, 29, 29, 30, 30, 28, 30, 27, 30, 30, 30, 25, 26, 30, 30, 29, 30, 30, 30, 29, 27, 30, 28, 30, 29, 30, 30, 30, 29, 27, 28, 29, 29, 29, 28, 30, 28, 29, 30, 28, 29, 28, 30, 30, 28, 30, 24, 28, 28, 30, 29, 29, 28, 28, 30, 30, 30, 30, 30, 30, 28, 29, 25, 29, 30, 30, 29, 30, 29, 30, 29, 30, 29, 30, 29, 30, 29, 30, 30, 30, 27, 30, 28, 28, 29, 29, 29, 23, 29, 29, 30, 29, 28, 30, 30, 29, 30, 29, 29, 29, 30, 29, 30, 30, 26, 29, 30, 28, 27, 26, 28, 29, 30, 29, 28, 30, 30, 30, 30, 30, 26, 24, 27, 29, 30, 26, 30, 25, 28, 29, 29, 30, 30, 30, 30, 30, 28, 28, 29, 30, 30, 28, 30, 29, 30, 30, 29, 29, 29, 29, 30, 27, 30, 30, 29, 30, 30, 28, 30, 29, 30, 28, 29, 30, 30, 29, 28, 30, 29, 29, 29, 29, 29, 29, 30, 30, 27, 30, 30, 27, 30, 28, 30, 30, 29, 29, 30, 28, 28, 29, 29, 28, 30, 29, 29, 30, 27, 29, 30, 30, 30, 29, 30, 29, 29, 26, 29, 29, 29, 30, 29, 29, 29, 30, 30, 28, 28], strides = [1, 1], with_bias = true} : (tensor<4x256x14x14x!quant.uniform<u8:f32, 0.015048952549019607:-127>>, tensor<256x256x3x3xsi8>, tensor<256xi32>) -> tensor<4x256x14x14x!quant.uniform<u8:f32, 0.012225580392156862:-127>>
    %50 = "top.Weight"() {name = "169_Conv_filter_int8"} : () -> tensor<256x256x3x3xsi8>
    %51 = "top.Weight"() {name = "169_Conv_bias_int32"} : () -> tensor<256xi32>
    %52 = "tpu.Conv"(%49, %50, %51) {dilations = [1, 1], do_relu = false, group = 1 : i64, kernel_shape = [3, 3], multiplier = [421881, 441877, 63785, 113563, 320291, 13317, 126917, 47967, 162239, 29645, 309003, 82369, 507619, 687391, 251657, 412387, 88777, 131837, 748397, 1090885, 904441, 761571, 185451, 261597, 114205, 377223, 10835, 759747, 270249, 538949, 314423, 69749, 359853, 81585, 322419, 486947, 58799, 157315, 159655, 460405, 177395, 354605, 57747, 262257, 288583, 22023, 301761, 793885, 701585, 1088259, 176981, 1103793, 238057, 133283, 373973, 397501, 322915, 96105, 530353, 117693, 14109, 59057, 419779, 276205, 316863, 361693, 777263, 264763, 278343, 821871, 321115, 146329, 2941, 360889, 698351, 46337, 204147, 620469, 212837, 75597, 367771, 59749, 545029, 242395, 588409, 213499, 524021, 135671, 911953, 174545, 203017, 442581, 898291, 15061, 322313, 102701, 119639, 278819, 232123, 498269, 751913, 136315, 77081, 246397, 64459, 1004915, 114231, 733573, 789783, 122093, 84087, 82085, 424359, 441245, 475591, 56241, 332313, 1030327, 679009, 398435, 375173, 73801, 548963, 110097, 324605, 106559, 173569, 88145, 59913, 118621, 33621, 496213, 8343, 441501, 378211, 227125, 83011, 1205121, 413195, 255497, 55887, 239319, 356871, 378235, 680349, 282827, 460917, 388431, 76559, 426281, 1692107, 134689, 152741, 832415, 136109, 676913, 191827, 242739, 679885, 297385, 600621, 397819, 247541, 510603, 403507, 324105, 634333, 93623, 721399, 169405, 212035, 120265, 568971, 860155, 190489, 75421, 453325, 14099, 918531, 67691, 370437, 294099, 716525, 451995, 627543, 87527, 414805, 1767115, 87267, 368197, 305481, 377211, 531135, 140489, 16767, 497113, 515859, 277767, 759729, 302383, 238183, 676331, 126653, 269587, 1092605, 732043, 101289, 794041, 133109, 104089, 100343, 178767, 223, 180095, 848617, 354589, 795927, 246909, 599847, 1026769, 59619, 524097, 153439, 745075, 806969, 235709, 1203687, 119471, 367947, 2197031, 135169, 433057, 273945, 479521, 686359, 61009, 420797, 331955, 129937, 287691, 272581, 313289, 702643, 62777, 69745, 158209, 1430125, 485535, 1493997, 52569, 776113, 559695, 834663, 551469, 189555, 235023], name = "169_Conv", pads = [1, 1, 1, 1], rshift = [30, 30, 28, 28, 30, 26, 28, 27, 29, 27, 30, 29, 30, 30, 28, 30, 27, 28, 30, 30, 30, 29, 27, 28, 28, 29, 25, 29, 30, 29, 30, 28, 30, 30, 30, 30, 26, 30, 30, 30, 28, 30, 29, 30, 29, 27, 30, 30, 30, 30, 29, 30, 29, 29, 30, 30, 30, 29, 30, 28, 26, 29, 30, 29, 29, 30, 29, 29, 30, 30, 30, 30, 24, 30, 30, 27, 29, 30, 30, 28, 29, 28, 30, 29, 30, 30, 29, 28, 30, 29, 30, 29, 30, 26, 30, 29, 28, 30, 30, 30, 29, 28, 28, 30, 29, 30, 29, 30, 29, 29, 28, 30, 29, 29, 29, 28, 29, 30, 30, 30, 29, 27, 29, 28, 29, 29, 28, 27, 25, 30, 27, 30, 25, 30, 30, 28, 29, 30, 30, 29, 28, 27, 30, 30, 30, 28, 30, 30, 27, 28, 30, 30, 29, 30, 27, 30, 29, 30, 30, 30, 29, 30, 30, 29, 29, 29, 30, 26, 30, 28, 27, 30, 30, 30, 29, 27, 30, 25, 30, 27, 29, 28, 30, 29, 30, 28, 30, 30, 27, 29, 30, 30, 30, 28, 26, 30, 30, 30, 30, 28, 28, 30, 29, 28, 30, 28, 28, 30, 30, 28, 29, 28, 21, 28, 29, 29, 30, 30, 30, 30, 27, 30, 29, 30, 30, 28, 30, 27, 30, 30, 29, 30, 28, 30, 30, 28, 30, 30, 30, 30, 30, 29, 30, 29, 28, 29, 30, 30, 30, 28, 30, 30, 30, 30, 29, 29], strides = [1, 1], with_bias = true} : (tensor<4x256x14x14x!quant.uniform<u8:f32, 0.012225580392156862:-127>>, tensor<256x256x3x3xsi8>, tensor<256xi32>) -> tensor<4x256x14x14x!quant.uniform<i8:f32, 0.034244826274509803:-127>>
    %53 = "tpu.Add"(%52, %46) {coeff = [3.500000e+01, 1.230000e+02], do_relu = true, name = "172_Relu", rshifts = [4, 7]} : (tensor<4x256x14x14x!quant.uniform<i8:f32, 0.034244826274509803:-127>>, tensor<4x256x14x14x!quant.uniform<u8:f32, 0.015048952549019607:-127>>) -> tensor<4x256x14x14x!quant.uniform<u8:f32, 0.015695025882352942:-127>>
    %54 = "top.Weight"() {name = "175_Relu_filter_int8"} : () -> tensor<512x256x3x3xsi8>
    %55 = "top.Weight"() {name = "175_Relu_bias_int32"} : () -> tensor<512xi32>
    %56 = "tpu.Conv"(%53, %54, %55) {dilations = [1, 1], do_relu = true, group = 1 : i64, kernel_shape = [3, 3], multiplier = [558431, 361475, 638435, 1050159, 361535, 263343, 104047, 1900993, 59039, 1583593, 1055605, 433169, 241095, 501913, 272871, 1120825, 844341, 969545, 118609, 821229, 362217, 1322855, 587245, 625699, 402381, 438775, 1211141, 290157, 21623, 267967, 116181, 1057309, 563055, 702283, 442627, 913813, 312505, 1352277, 762221, 1674879, 111645, 1004809, 67995, 851971, 1019889, 859067, 463207, 440371, 281861, 395959, 953805, 344831, 793815, 263661, 144569, 917113, 98319, 1253773, 730197, 81035, 255113, 1087869, 21261, 860561, 317175, 1255411, 1258125, 2340367, 564061, 1644875, 223669, 1440873, 751025, 480135, 749801, 982609, 1196731, 91519, 317431, 1131795, 828273, 675677, 880927, 1093729, 197105, 826257, 2170571, 716909, 1562695, 56959, 246137, 116759, 1980313, 384457, 1237021, 192559, 798327, 1068003, 421617, 189507, 1127311, 537421, 872953, 1446061, 899155, 1328075, 93513, 398255, 274533, 324143, 950837, 841019, 823631, 940507, 626391, 1703891, 505927, 398715, 869387, 692155, 298519, 1754769, 181463, 1155309, 490333, 248271, 1281083, 372677, 349581, 307987, 489181, 965339, 1161097, 687575, 1333661, 687911, 79993, 1188785, 593417, 1297199, 365411, 82853, 825575, 471939, 1366413, 812479, 265009, 123841, 787597, 378465, 872897, 632095, 38947, 439849, 661053, 113753, 1790153, 190383, 1489399, 521121, 1389375, 141121, 862311, 514713, 649041, 475009, 64639, 2147071, 502029, 1755721, 774349, 957009, 964149, 335221, 961173, 906909, 1585761, 363973, 30025, 713461, 540393, 268587, 873113, 538531, 56971, 1066771, 206257, 863797, 88351, 596593, 603967, 565727, 323101, 121879, 538105, 232733, 1678115, 561013, 1083517, 751609, 869651, 404817, 879093, 474489, 293303, 778763, 544907, 726041, 543741, 521055, 544293, 1146133, 945937, 934517, 921507, 445513, 1094529, 481689, 390275, 494457, 892789, 1114103, 68155, 470991, 534111, 1158395, 891043, 407075, 399137, 2055705, 1001409, 350725, 236251, 712669, 552459, 186367, 890911, 1057321, 1186747, 878107, 916615, 1181255, 1111683, 1045173, 1414707, 895973, 733261, 1209517, 1069447, 1376567, 50553, 1057093, 208289, 725203, 1043589, 1125791, 1089681, 851519, 338493, 960985, 541657, 1302007, 797715, 1489485, 393567, 338031, 391935, 497399, 976543, 1075223, 2077, 561933, 596239, 598101, 88037, 599983, 904553, 1207363, 85861, 387763, 693187, 601443, 1029801, 479953, 336615, 29619, 1522047, 577293, 545583, 41171, 657487, 991655, 248353, 1251427, 1543103, 921259, 865981, 283591, 20571, 248619, 1334731, 923275, 1076579, 46815, 786581, 334557, 1297485, 478315, 366569, 373059, 980329, 1082717, 782515, 972265, 597541, 843279, 458157, 16715, 1212713, 1111069, 800473, 1005199, 943653, 1282735, 256423, 206097, 1195705, 655651, 941355, 438169, 251513, 471141, 1289057, 589021, 1885121, 801881, 852357, 217251, 930815, 1693735, 1259585, 234409, 138735, 497521, 925117, 1077733, 204499, 458207, 1714065, 1742497, 962523, 394235, 444747, 388525, 1012647, 614043, 473055, 406207, 972469, 136173, 589353, 1586293, 404535, 638351, 557117, 1127435, 1099393, 190321, 1512141, 1077675, 959001, 37691, 155011, 236753, 701227, 52169, 689849, 973587, 667783, 228401, 1359385, 1025137, 1086619, 335575, 524923, 994761, 854767, 1095279, 982045, 567815, 472245, 224997, 261427, 288829, 1010231, 9153, 1345377, 218241, 384655, 2473047, 547403, 172893, 66873, 1892267, 835781, 1010055, 152303, 1317843, 596257, 231533, 106483, 206077, 793283, 858115, 401009, 907765, 1516219, 213511, 301837, 1138627, 363223, 1258345, 971227, 450917, 778103, 992757, 273429, 33805, 518259, 433575, 848881, 1345943, 382621, 1464469, 366237, 142699, 554401, 1194963, 1233179, 1086851, 1080309, 891545, 859675, 423739, 1199643, 90031, 341679, 553135, 1264923, 49147, 525679, 935845, 85959, 125731, 717943, 426209, 911863, 681073, 1281387, 652877, 80633, 334425, 941393, 2161595, 630623, 407007, 1945995, 1569975, 353299, 364463, 1250119, 158229, 370099, 1496633, 158365, 49397, 205541, 207345, 332959, 615595, 887293, 496551, 868247, 233731, 2310393, 788037, 322989, 697397, 185309, 798097, 632281, 1251751, 54739, 228095, 250673, 1404653, 572757, 379159, 135327, 752195, 1631821, 1529989, 211621, 685765, 161537, 1591979, 871063, 1140591, 1252345, 1219293, 571495, 894717], name = "175_Relu", pads = [1, 1, 1, 1], rshift = [29, 29, 29, 30, 29, 28, 27, 30, 26, 30, 30, 29, 27, 29, 28, 30, 29, 30, 27, 30, 29, 30, 29, 29, 29, 29, 30, 28, 25, 28, 27, 30, 29, 29, 29, 30, 28, 30, 30, 30, 27, 29, 26, 30, 30, 30, 29, 29, 28, 29, 30, 29, 29, 28, 26, 30, 26, 30, 30, 26, 28, 30, 25, 29, 29, 30, 30, 30, 29, 30, 28, 30, 30, 29, 29, 30, 30, 27, 28, 30, 30, 29, 29, 30, 28, 30, 30, 30, 30, 26, 28, 27, 30, 28, 30, 28, 30, 30, 29, 28, 30, 29, 30, 30, 30, 30, 27, 28, 28, 28, 30, 30, 30, 30, 29, 30, 29, 29, 30, 30, 28, 30, 27, 30, 29, 28, 30, 28, 28, 28, 29, 30, 30, 30, 30, 29, 27, 30, 29, 30, 28, 26, 30, 29, 30, 30, 28, 27, 30, 29, 30, 29, 25, 29, 29, 26, 30, 28, 30, 29, 30, 27, 30, 29, 29, 29, 26, 30, 29, 30, 30, 30, 30, 28, 29, 30, 30, 28, 25, 30, 29, 28, 30, 29, 26, 30, 28, 30, 26, 29, 29, 29, 28, 27, 30, 28, 30, 29, 30, 30, 30, 29, 30, 29, 28, 29, 28, 29, 29, 28, 29, 30, 30, 30, 30, 29, 28, 29, 29, 29, 30, 30, 26, 29, 29, 30, 30, 29, 29, 30, 30, 29, 28, 29, 29, 28, 30, 30, 30, 29, 30, 30, 29, 30, 30, 30, 30, 30, 30, 30, 26, 30, 28, 29, 30, 30, 30, 30, 28, 29, 29, 30, 29, 30, 29, 28, 29, 29, 30, 30, 21, 29, 29, 29, 26, 28, 30, 30, 27, 29, 30, 29, 30, 29, 29, 25, 29, 29, 29, 25, 30, 30, 28, 30, 30, 30, 30, 28, 24, 28, 30, 30, 30, 26, 30, 28, 30, 29, 29, 29, 30, 30, 30, 30, 29, 30, 29, 24, 30, 29, 30, 30, 30, 30, 28, 27, 30, 29, 29, 29, 28, 29, 30, 29, 30, 29, 30, 28, 29, 30, 30, 28, 27, 29, 30, 30, 28, 28, 30, 30, 30, 29, 28, 29, 30, 29, 29, 29, 30, 28, 29, 30, 28, 29, 29, 30, 30, 28, 30, 30, 30, 25, 28, 28, 29, 26, 29, 30, 28, 28, 30, 30, 30, 28, 29, 30, 29, 30, 30, 29, 29, 28, 28, 28, 30, 23, 30, 28, 29, 30, 29, 28, 26, 30, 30, 30, 27, 30, 30, 28, 27, 28, 30, 30, 28, 29, 30, 28, 28, 30, 29, 30, 30, 29, 30, 30, 28, 25, 29, 29, 30, 30, 28, 30, 28, 28, 29, 30, 30, 30, 30, 30, 30, 29, 30, 27, 29, 29, 30, 25, 29, 30, 26, 27, 30, 29, 30, 30, 30, 29, 26, 28, 29, 30, 29, 29, 30, 30, 28, 29, 30, 27, 28, 30, 28, 26, 27, 27, 29, 29, 30, 30, 30, 28, 30, 29, 28, 30, 28, 30, 30, 30, 26, 28, 28, 30, 28, 28, 27, 30, 30, 30, 28, 29, 28, 30, 30, 30, 30, 30, 29, 29], strides = [2, 2], with_bias = true} : (tensor<4x256x14x14x!quant.uniform<u8:f32, 0.015695025882352942:-127>>, tensor<512x256x3x3xsi8>, tensor<512xi32>) -> tensor<4x512x7x7x!quant.uniform<u8:f32, 0.009141872549019608:-127>>
    %57 = "top.Weight"() {name = "176_Conv_filter_int8"} : () -> tensor<512x512x3x3xsi8>
    %58 = "top.Weight"() {name = "176_Conv_bias_int32"} : () -> tensor<512xi32>
