module attributes {module.chip = "ALL", module.name = "resnet50", module.state = "TOP_QUANTIZED", module.weight_file = "resnet50_top_quantized_all_weight.npz"} {
  func @main(%arg0: tensor<4x3x224x224xf32>) -> tensor<4x1000xf32> {
    %0 = "quant.qcast"(%arg0) {name = "input_1_int8"} : (tensor<4x3x224x224xf32>) -> tensor<4x3x224x224x!quant.uniform<i8:f32, 1.0774157047271729:-13>>
    %1 = "top.Weight"() {name = "resnet50/conv1_conv/Conv2D;StatefulPartitionedCall/resnet50/conv1_conv/Conv2D"} : () -> tensor<64x3x7x7x!quant.uniform<i8<-127:127>:f32:0, {6.6312561102677137E-5,1.0053779078589287E-5,5.7764882512856275E-6,8.9858716819435358E-5,7.1313363150693476E-5,3.5003013181267306E-5,6.5083945628430229E-6,4.6398054109886289E-5,4.2780920921359211E-5,1.8264107347931713E-4,4.9291313189314678E-5,1.2320287351030856E-4,1.1452220496721566E-4,1.8682783775147982E-5,6.6633227106649429E-5,7.8414021118078381E-5,2.6986033844877966E-5,1.7180889699375257E-5,1.6034378495533019E-4,1.8852926586987451E-5,8.2538819697219878E-5,6.8191395257599652E-5,1.9918385078199208E-5,6.2587682805315126E-6,7.5941832619719207E-5,2.3895827325759456E-5,1.8249187633045949E-5,4.1593561036279425E-5,6.7093184043187648E-5,4.5906952436780557E-5,4.255178282619454E-5,7.8124830906745046E-6,1.2932716344948858E-4,2.7417698220233433E-5,3.197774276486598E-5,3.9874917092674877E-6,1.0742055746959522E-4,1.9271497876616195E-5,3.3612308470765129E-5,2.6261390303261578E-5,5.7122448197333142E-5,1.1656467540888116E-4,3.9874958019936457E-5,1.3535101970774122E-5,9.8637545306701213E-5,1.2218335541547276E-5,5.5894928664201871E-5,5.8700650697574019E-5,3.0134538974380121E-5,9.687501733424142E-5,1.3150826816854533E-5,3.8961024984018877E-5,3.102803384535946E-5,5.3582283726427704E-5,2.1673529772670008E-5,8.7782245827838778E-5,1.2320368114160374E-5,1.0354292317060754E-4,1.8496701159165241E-5,1.2037140550091863E-4,1.217138342326507E-4,1.4538635696226265E-5,1.0918329280684702E-5,1.0194173228228465E-4}>>
    %2 = "top.Weight"() {name = "resnet50/conv1_bn/FusedBatchNormV3;StatefulPartitionedCall/resnet50/conv1_bn/FusedBatchNormV3"} : () -> tensor<64x!quant.uniform<i32:f32:0, {7.1446193032898009E-5,1.0832099178514909E-5,6.2236790654424112E-6,9.6815194410737604E-5,7.683413423364982E-5,3.7712794437538832E-5,7.0122464421729092E-6,4.9989990657195449E-5,4.6092834963928908E-5,1.9678035459946841E-4,5.3107236453797668E-5,1.3274070806801319E-4,1.2338801752775908E-4,2.0129124095547013E-5,7.1791684604249895E-5,8.4484498074743897E-5,2.9075175916659646E-5,1.8510960217099637E-5,1.727569178910926E-4,2.0312440028646961E-5,8.8928623881656677E-5,7.3470480856485665E-5,2.1460380594362505E-5,6.7432952164381277E-6,8.1820922787301242E-5,2.5745739549165592E-5,1.9661962141981348E-5,4.4813554268330336E-5,7.2287250077351928E-5,4.9460872105555609E-5,4.5845958084100857E-5,8.4172916103852913E-6,1.3933911395724863E-4,2.9540258765337057E-5,3.4453321859473363E-5,4.2961860344803426E-6,1.1573659867281094E-4,2.0763414795510471E-5,3.6214427382219583E-5,2.8294434741837904E-5,6.1544626078102738E-5,1.2558861635625362E-4,4.2961906729033217E-5,1.4582931726181414E-5,1.0627364099491388E-4,1.3164226402295753E-5,6.0222075262572616E-5,6.3245002820622176E-5,3.2467425626236945E-5,1.043746669893153E-4,1.4168907000566833E-5,4.197721864329651E-5,3.3430089388275519E-5,5.7730394473765045E-5,2.3351401978288777E-5,9.4577968411613256E-5,1.3274157936393749E-5,1.1155877291457728E-4,1.9928636902477592E-5,1.2969004455953836E-4,1.3113640306983143E-4,1.5664154489059001E-5,1.1763579095713794E-5,1.0983362153638154E-4}>>
    %3 = "top.Conv"(%0, %1, %2) {dilations = [1, 1], do_relu = true, kernel_shape = [7, 7], name = "resnet50/conv1_relu/Relu;StatefulPartitionedCall/resnet50/conv1_relu/Relu;resnet50/conv1_bn/FusedBatchNormV3;StatefulPartitionedCall/resnet50/conv1_bn/FusedBatchNormV3;unknown_0;resnet50/conv1_conv/BiasAdd;StatefulPartitionedCall/resnet50/conv1_conv/BiasAdd;resnet50/conv2_block3_2_conv/Conv2D;StatefulPartitionedCall/resnet50/conv2_block3_2_conv/Conv2D;resnet50/conv1_conv/Conv2D;StatefulPartitionedCall/resnet50/conv1_conv/Conv2D", pads = [3, 3, 3, 3], strides = [2, 2]} : (tensor<4x3x224x224x!quant.uniform<i8:f32, 1.0774157047271729:-13>>, tensor<64x3x7x7x!quant.uniform<i8<-127:127>:f32:0, {6.6312561102677137E-5,1.0053779078589287E-5,5.7764882512856275E-6,8.9858716819435358E-5,7.1313363150693476E-5,3.5003013181267306E-5,6.5083945628430229E-6,4.6398054109886289E-5,4.2780920921359211E-5,1.8264107347931713E-4,4.9291313189314678E-5,1.2320287351030856E-4,1.1452220496721566E-4,1.8682783775147982E-5,6.6633227106649429E-5,7.8414021118078381E-5,2.6986033844877966E-5,1.7180889699375257E-5,1.6034378495533019E-4,1.8852926586987451E-5,8.2538819697219878E-5,6.8191395257599652E-5,1.9918385078199208E-5,6.2587682805315126E-6,7.5941832619719207E-5,2.3895827325759456E-5,1.8249187633045949E-5,4.1593561036279425E-5,6.7093184043187648E-5,4.5906952436780557E-5,4.255178282619454E-5,7.8124830906745046E-6,1.2932716344948858E-4,2.7417698220233433E-5,3.197774276486598E-5,3.9874917092674877E-6,1.0742055746959522E-4,1.9271497876616195E-5,3.3612308470765129E-5,2.6261390303261578E-5,5.7122448197333142E-5,1.1656467540888116E-4,3.9874958019936457E-5,1.3535101970774122E-5,9.8637545306701213E-5,1.2218335541547276E-5,5.5894928664201871E-5,5.8700650697574019E-5,3.0134538974380121E-5,9.687501733424142E-5,1.3150826816854533E-5,3.8961024984018877E-5,3.102803384535946E-5,5.3582283726427704E-5,2.1673529772670008E-5,8.7782245827838778E-5,1.2320368114160374E-5,1.0354292317060754E-4,1.8496701159165241E-5,1.2037140550091863E-4,1.217138342326507E-4,1.4538635696226265E-5,1.0918329280684702E-5,1.0194173228228465E-4}>>, tensor<64x!quant.uniform<i32:f32:0, {7.1446193032898009E-5,1.0832099178514909E-5,6.2236790654424112E-6,9.6815194410737604E-5,7.683413423364982E-5,3.7712794437538832E-5,7.0122464421729092E-6,4.9989990657195449E-5,4.6092834963928908E-5,1.9678035459946841E-4,5.3107236453797668E-5,1.3274070806801319E-4,1.2338801752775908E-4,2.0129124095547013E-5,7.1791684604249895E-5,8.4484498074743897E-5,2.9075175916659646E-5,1.8510960217099637E-5,1.727569178910926E-4,2.0312440028646961E-5,8.8928623881656677E-5,7.3470480856485665E-5,2.1460380594362505E-5,6.7432952164381277E-6,8.1820922787301242E-5,2.5745739549165592E-5,1.9661962141981348E-5,4.4813554268330336E-5,7.2287250077351928E-5,4.9460872105555609E-5,4.5845958084100857E-5,8.4172916103852913E-6,1.3933911395724863E-4,2.9540258765337057E-5,3.4453321859473363E-5,4.2961860344803426E-6,1.1573659867281094E-4,2.0763414795510471E-5,3.6214427382219583E-5,2.8294434741837904E-5,6.1544626078102738E-5,1.2558861635625362E-4,4.2961906729033217E-5,1.4582931726181414E-5,1.0627364099491388E-4,1.3164226402295753E-5,6.0222075262572616E-5,6.3245002820622176E-5,3.2467425626236945E-5,1.043746669893153E-4,1.4168907000566833E-5,4.197721864329651E-5,3.3430089388275519E-5,5.7730394473765045E-5,2.3351401978288777E-5,9.4577968411613256E-5,1.3274157936393749E-5,1.1155877291457728E-4,1.9928636902477592E-5,1.2969004455953836E-4,1.3113640306983143E-4,1.5664154489059001E-5,1.1763579095713794E-5,1.0983362153638154E-4}>>) -> tensor<4x64x112x112x!quant.uniform<i8:f32, 0.13142697513103485:-128>>
    %4 = "top.MaxPool"(%3) {kernel_shape = [3, 3], name = "resnet50/pool1_pool/MaxPool;StatefulPartitionedCall/resnet50/pool1_pool/MaxPool", pads = [1, 1, 1, 1], strides = [2, 2]} : (tensor<4x64x112x112x!quant.uniform<i8:f32, 0.13142697513103485:-128>>) -> tensor<4x64x56x56x!quant.uniform<i8:f32, 0.13142697513103485:-128>>
    %5 = "top.Weight"() {name = "resnet50/conv2_block1_0_conv/Conv2D;StatefulPartitionedCall/resnet50/conv2_block1_0_conv/Conv2D"} : () -> tensor<256x64x1x1x!quant.uniform<i8<-127:127>:f32:0, {2.6118732057511806E-4,0.001617282279767096,0.0017026182031258941,7.3020212585106492E-4,0.001227283850312233,5.587018677033484E-4,0.0010861101327463984,0.0050050187855958939,6.8964401725679636E-4,0.0017378178890794516,0.002603436354547739,2.6014726608991623E-4,0.0017324925865978003,0.0023772795684635639,0.0042612715624272823,0.00184152543079108,0.0017438255017623305,0.0030305210966616869,0.0019435802241787314,5.8595335576683283E-4,9.5263245748355985E-4,0.0020411277655512094,0.003655886510387063,0.0068143140524625778,0.0038206665776669979,0.0019010505639016628,0.0018614623695611954,0.0013995785266160965,0.0041974000632762909,7.5271533569321036E-4,0.0053534512408077717,2.8713565552607179E-4,0.001775176846422255,0.0032133131753653288,0.0036695436574518681,0.0026547983288764954,5.9139949735254049E-4,0.0026907341089099646,0.0031253185588866472,6.7973928526043892E-4,0.0056274146772921085,0.0027057011611759663,0.0032755245920270681,0.0022630121093243361,9.2166487593203783E-4,0.001815628376789391,0.0017826483817771077,0.0019160730298608541,0.0047579766251146793,0.0042254282161593437,4.5658959425054491E-4,0.0012177694588899612,0.0012889271602034569,0.0015970428939908743,0.0024219308979809284,0.0031045803334563971,0.0024402146227657795,0.0025622283574193716,9.4366661505773664E-4,0.002936334116384387,0.0039203655906021595,9.4304600497707725E-4,0.0013961694203317165,5.530913476832211E-4,0.0056079532951116562,0.0025964647065848112,0.005911409854888916,0.0022568032145500183,0.0010556582128629088,0.0033859547693282366,0.0017767135286703706,9.9710747599601745E-4,2.8348507476039231E-4,0.0025011305697262287,0.0020681705791503191,1.1251690011704341E-4,7.9347350401803851E-4,0.0085160303860902786,0.003950310405343771,0.008067931979894638,0.0023141340352594852,6.9315254222601652E-4,9.8277989309281111E-4,0.0040891864337027073,0.0024779236409813166,0.0020000282675027847,0.0017714974237605929,0.004050013143569231,0.001950199599377811,0.0010338989086449146,0.0063032521866261959,0.0023768164683133364,0.0047306749038398266,0.0024019016418606043,0.0014316079905256629,0.003181779058650136,0.0018076926935464144,8.734200382605195E-4,0.0018355237552896142,4.0842258022166789E-4,0.0015290408628061414,0.0015000494895502925,9.6320785814896226E-4,0.0020549825858324766,8.3283131243661046E-4,0.010421878658235073,0.0038363311905413866,0.0046763280406594276,0.0027385822031646967,0.0038813413120806217,0.0015162682393565774,0.002276112325489521,0.001282435143366456,5.9747812338173389E-4,0.0023298461455851793,0.0018611971754580736,0.0049049793742597103,0.0012473735259845853,6.8270455813035369E-4,0.0023495953064411879,0.0036748421844094992,0.0051124636083841324,8.4203475853428245E-4,0.0091719869524240494,0.0063095781952142715,0.0019750043284147978,0.0070182285271584988,0.0024153329432010651,0.0025410866364836693,0.0031419885344803333,7.6850247569382191E-4,0.0040694042108952999,0.0048423898406326771,9.0588483726605773E-4,3.6083745271753287E-6,0.0012674520257860422,0.0030974638648331165,0.001785148517228663,0.0020076541695743799,0.0012950059026479721,7.4753136141225696E-4,0.0010154105257242918,0.0016975558828562498,0.0013453126884996891,8.0278218956664205E-4,0.004713479895144701,0.0019998790230602026,0.0096590043976902962,9.143862989731133E-4,0.0078469580039381981,0.0012668921845033765,9.7041466506198049E-4,0.0076089510694146156,7.5611629290506244E-4,0.0013398549053817987,0.0030668287072330713,1.7199829744640738E-4,1.9925963715650141E-4,0.0026601944118738174,9.6107990248128772E-4,8.676016004756093E-4,0.0087997298687696457,0.0029215696267783642,7.8615109669044614E-4,0.0037260791286826134,0.0028270070906728506,0.0023329653777182102,0.0023401179350912571,0.0018938812427222729,0.0036780675873160362,0.001616473775357008,0.002752846572548151,0.0012315113563090563,0.0029990077018737793,9.1660179896280169E-4,0.0029163851868361235,0.0018211432034149766,0.0016218023374676704,0.0023492893669754267,0.0018663341179490089,0.0045333378948271275,0.001361705013550818,6.8844843190163374E-4,4.7163269482553005E-4,0.0047624651342630386,0.00135762058198452,0.0060516661033034325,0.0022312940564006567,0.008293474093079567,0.004325703252106905,0.0017303064232692122,0.0029435751494020224,0.0013088270789012313,0.0011245716596022248,7.3323328979313374E-4,0.0022164643742144108,9.8080513998866081E-4,0.0012391000054776669,1.4818987983744591E-4,0.0028330301865935326,0.0021087001077830791,0.0048765284009277821,3.2169840415008366E-4,0.0037853834219276905,0.0040191616863012314,0.0018164232606068254,0.0023197156842797995,0.0036960593424737453,0.0011040649842470884,0.0026917767245322466,1.3223118730820715E-4,0.0012565108481794596,0.0015201573260128498,0.0013300299178808928,0.0029244846664369106,0.0022792888339608908,1.0473844304215163E-4,0.0021307552233338356,0.0016131929587572813,0.0027964867185801268,0.0024337123613804579,0.0030806327704340219,0.0025098666083067656,0.0035855153109878302,0.0021915496326982975,0.0031617754139006138,0.0037295869551599026,0.0013254607329145074,0.0039099776186048985,7.2966527659446001E-4,0.0010063642403110862,0.0031267828308045864,0.0011777554173022509,2.6265054475516081E-4,4.717910778708756E-4,0.0031914669089019299,0.0012601775815710425,0.0018946105847135186,0.0028615675400942564,0.0018196285236626863,0.0020886044949293137,8.4353372221812606E-4,0.0017051557078957558,0.0017562382854521275,0.0019051943672820926,0.01317120436578989,0.0024567029904574156,0.0028736994136124849,0.0010744257597252727,0.0033628211822360754,1.5389053442049772E-4,5.720420740544796E-4,2.9517407529056072E-4,0.0049000633880496025,0.0070185670629143715,0.0015057801501825452}>>
    %6 = "top.Weight"() {name = "resnet50/conv2_block1_0_bn/FusedBatchNormV3;StatefulPartitionedCall/resnet50/conv2_block1_0_bn/FusedBatchNormV3;resnet50/conv4_block6_2_conv/Conv2D;StatefulPartitionedCall/resnet50/conv4_block6_2_conv/Conv2D;unknown_60;resnet50/conv2_block1_0_conv/BiasAdd;StatefulPartitionedCall/resnet50/conv2_block1_0_conv/BiasAdd"} : () -> tensor<256x!quant.uniform<i32:f32:0, {3.432705852901563E-5,2.1255451429169625E-4,2.2376996639650315E-4,9.5968258392531425E-5,1.6129820141941309E-4,7.3428498581051826E-5,1.427441748091951E-4,6.5779447322711349E-4,9.0637826360762119E-5,2.2839615121483803E-4,3.4216177300550044E-4,3.4190368751296774E-5,2.276962623000145E-4,3.1243867124430835E-4,5.600460572168231E-4,2.4202611530199647E-4,2.2918570903129876E-4,3.9829223533160985E-4,2.5543887750245631E-4,7.701007416471839E-5,1.2520160817075521E-4,2.6825926033779979E-4,4.8048209282569587E-4,8.955847006291151E-4,5.0213863141834736E-4,2.4984931224025786E-4,2.4464636226184666E-4,1.8394237849861383E-4,5.5165158119052649E-4,9.8927099315915257E-5,7.0358789525926113E-4,3.7737368984380737E-5,2.3330612748395652E-4,4.2231602128595114E-4,4.8227701336145401E-4,3.4891211544163525E-4,7.7725846495013684E-5,3.5363505594432354E-4,4.1075117769651115E-4,8.9336077508050948E-5,7.3959410656243563E-4,3.5560212563723326E-4,4.3049227679148316E-4,2.9742083279415965E-4,1.2113162665627897E-4,2.3862253874540329E-4,2.3428809072356671E-4,2.5182368699461222E-4,6.2532647280022502E-4,5.5533525301143527E-4,6.0008187574567273E-5,1.6004775534383953E-4,1.6939979104790837E-4,2.0989451149944216E-4,3.1830705120228231E-4,4.0802560397423804E-4,3.2071003806777298E-4,3.3674592850729823E-4,1.2402325228322297E-4,3.859135031234473E-4,5.1524181617423892E-4,1.2394168879836798E-4,1.8349432502873242E-4,7.2691123932600021E-5,7.3703634552657604E-4,3.4124549711123109E-4,7.7691872138530016E-4,2.9660481959581375E-4,1.3874196156393737E-4,4.4500580406747758E-4,2.3350807896349579E-4,1.310468214796856E-4,3.7257585063343868E-5,3.2871603616513312E-4,2.7181339100934565E-4,1.4787755389988888E-5,1.0428381938254461E-4,0.0011192361125722528,5.1917735254392028E-4,0.001060343929566443,3.0413962667807937E-4,9.1098940174560994E-5,1.2916378909721971E-4,5.3742941236123443E-4,3.2566601294092834E-4,2.6285767671652138E-4,2.3282255278900266E-4,5.3228100296109915E-4,2.5630882009863853E-4,1.3588220463134348E-4,8.2841736730188131E-4,3.1237778603099287E-4,6.2173831975087523E-4,3.1567466794513166E-4,1.8815191288013011E-4,4.181716067250818E-4,2.3757958842907101E-4,1.1479095701361075E-4,2.4123732873704284E-4,5.3677744290325791E-5,2.00957219931297E-4,1.9714696099981666E-4,1.2659149069804698E-4,2.7008014149032533E-4,1.094565013772808E-4,0.0013697160175070167,5.0419737817719579E-4,6.1459565768018365E-4,3.599235787987709E-4,5.1011296454817057E-4,1.9927855464629829E-4,2.991425571963191E-4,1.6854656860232353E-4,7.852473936509341E-5,3.0620463076047599E-4,2.4461152497678995E-4,6.4464658498764038E-4,1.6393853002227843E-4,8.9725792349781841E-5,3.0880019767209888E-4,4.8297338071279228E-4,6.7191565176472068E-4,1.106660783989355E-4,0.0012054465478286147,8.2924880553036928E-4,2.595688565634191E-4,9.2238455545157194E-4,3.1743990257382393E-4,3.3396732760593295E-4,4.1294205584563315E-4,1.0100195504492149E-4,5.3482950897887349E-4,6.3642062013968825E-4,1.1905770224984735E-4,4.7423773708032968E-7,1.665773888817057E-4,4.0709029417484999E-4,2.3461667296942323E-4,2.6385992532595992E-4,1.7019870574586093E-4,9.8245785920880734E-5,1.3345234037842602E-4,2.2310463828034699E-4,1.7681038298178464E-4,1.0550723527558148E-4,6.1947840731590986E-4,2.6283806073479354E-4,0.0012694537872448564,1.2017502740491182E-4,0.0010313019156455994,1.6650381439831108E-4,1.2753866030834615E-4,0.0010000214679166675,9.9374075944069773E-5,1.7609307542443275E-4,4.0306401206180453E-4,2.2605216145166196E-5,2.6188090487266891E-5,3.4962131758220494E-4,1.26311817439273E-4,1.1402625386836007E-4,0.0011565218446776271,3.8397306343540549E-4,1.0332145757274702E-4,4.8970733769237995E-4,3.7154500023461878E-4,3.0661458731628954E-4,3.0755461193621159E-4,2.4890707572922111E-4,4.8339730710722506E-4,2.1244825620669872E-4,3.6179830203764141E-4,1.6185380809474736E-4,3.9415049832314253E-4,1.2046620395267382E-4,3.8329168455675244E-4,2.3934734053909779E-4,2.131485816789791E-4,3.0876000528223813E-4,2.452866465318948E-4,5.958029069006443E-4,1.789647649275139E-4,9.0480694780126214E-5,6.1985258071217686E-5,6.2591640744358301E-4,1.7842795932665467E-4,7.9535215627402067E-4,2.9325223295018077E-4,0.0010899861808866262,5.6851410772651434E-4,2.2740893473383039E-4,3.8686516927555203E-4,1.7201517766807228E-4,1.4779904449824244E-4,9.6366631623823196E-5,2.9130320763215423E-4,1.2890425568912178E-4,1.6285116726066917E-4,1.9476146917440929E-5,3.7233659531921148E-4,2.7714009047485888E-4,6.4090738305822015E-4,4.2279847548343241E-5,4.9750151811167598E-4,5.2822625730186701E-4,2.3872702149674296E-4,3.048732178285718E-4,4.857619060203433E-4,1.451039279345423E-4,3.5377207677811384E-4,1.7378744814777747E-5,1.651394268264994E-4,1.9978967611677945E-4,1.7480181122664362E-4,3.8435618625953794E-4,2.9956002254039049E-4,1.3765456969849765E-5,2.8003871557302773E-4,2.1201706840656698E-4,3.6753379390574992E-4,3.1985546229407191E-4,4.0487825754098594E-4,3.2986418227665126E-4,4.7123341937549412E-4,2.8802873566746712E-4,4.1554257040843368E-4,4.9016834236681461E-4,1.7420129734091461E-4,5.1387655548751354E-4,9.5897703431546688E-5,1.3226340524852276E-4,4.1094361222349107E-4,1.5478883869946003E-4,3.4519365726737306E-5,6.2006074585951865E-5,4.1944484109990299E-4,1.65621328051202E-4,2.4900294374674559E-4,3.760871768463403E-4,2.3914827033877373E-4,2.7449897606857121E-4,1.1086308222729713E-4,2.2410345263779163E-4,2.3081708059180528E-4,2.5039393221959472E-4,0.0017310515977442265,3.2287705107592046E-4,3.7768163019791245E-4,1.4120852574706078E-4,4.4196541421115398E-4,2.0225366824888624E-5,7.518175698351115E-5,3.8793834391981363E-5,6.4400047995150089E-4,9.2242902610450983E-4,1.9790012447629124E-4}>>
    %7 = "top.Conv"(%4, %5, %6) {dilations = [1, 1], do_relu = false, kernel_shape = [1, 1], name = "resnet50/conv2_block1_0_bn/FusedBatchNormV3;StatefulPartitionedCall/resnet50/conv2_block1_0_bn/FusedBatchNormV3;resnet50/conv4_block6_2_conv/Conv2D;StatefulPartitionedCall/resnet50/conv4_block6_2_conv/Conv2D;unknown_60;resnet50/conv2_block1_0_conv/BiasAdd;StatefulPartitionedCall/resnet50/conv2_block1_0_conv/BiasAdd;resnet50/conv4_block6_2_bn/FusedBatchNormV3;StatefulPartitionedCall/resnet50/conv4_block6_2_bn/FusedBatchNormV3;resnet50/conv4_block6_2_conv/BiasAdd;StatefulPartitionedCall/resnet50/conv4_block6_2_conv/BiasAdd;resnet50/conv2_block1_0_conv/Conv2D;StatefulPartitionedCall/resnet50/conv2_block1_0_conv/Conv2D", pads = [0, 0, 0, 0], strides = [1, 1]} : (tensor<4x64x56x56x!quant.uniform<i8:f32, 0.13142697513103485:-128>>, tensor<256x64x1x1x!quant.uniform<i8<-127:127>:f32:0, {2.6118732057511806E-4,0.001617282279767096,0.0017026182031258941,7.3020212585106492E-4,0.001227283850312233,5.587018677033484E-4,0.0010861101327463984,0.0050050187855958939,6.8964401725679636E-4,0.0017378178890794516,0.002603436354547739,2.6014726608991623E-4,0.0017324925865978003,0.0023772795684635639,0.0042612715624272823,0.00184152543079108,0.0017438255017623305,0.0030305210966616869,0.0019435802241787314,5.8595335576683283E-4,9.5263245748355985E-4,0.0020411277655512094,0.003655886510387063,0.0068143140524625778,0.0038206665776669979,0.0019010505639016628,0.0018614623695611954,0.0013995785266160965,0.0041974000632762909,7.5271533569321036E-4,0.0053534512408077717,2.8713565552607179E-4,0.001775176846422255,0.0032133131753653288,0.0036695436574518681,0.0026547983288764954,5.9139949735254049E-4,0.0026907341089099646,0.0031253185588866472,6.7973928526043892E-4,0.0056274146772921085,0.0027057011611759663,0.0032755245920270681,0.0022630121093243361,9.2166487593203783E-4,0.001815628376789391,0.0017826483817771077,0.0019160730298608541,0.0047579766251146793,0.0042254282161593437,4.5658959425054491E-4,0.0012177694588899612,0.0012889271602034569,0.0015970428939908743,0.0024219308979809284,0.0031045803334563971,0.0024402146227657795,0.0025622283574193716,9.4366661505773664E-4,0.002936334116384387,0.0039203655906021595,9.4304600497707725E-4,0.0013961694203317165,5.530913476832211E-4,0.0056079532951116562,0.0025964647065848112,0.005911409854888916,0.0022568032145500183,0.0010556582128629088,0.0033859547693282366,0.0017767135286703706,9.9710747599601745E-4,2.8348507476039231E-4,0.0025011305697262287,0.0020681705791503191,1.1251690011704341E-4,7.9347350401803851E-4,0.0085160303860902786,0.003950310405343771,0.008067931979894638,0.0023141340352594852,6.9315254222601652E-4,9.8277989309281111E-4,0.0040891864337027073,0.0024779236409813166,0.0020000282675027847,0.0017714974237605929,0.004050013143569231,0.001950199599377811,0.0010338989086449146,0.0063032521866261959,0.0023768164683133364,0.0047306749038398266,0.0024019016418606043,0.0014316079905256629,0.003181779058650136,0.0018076926935464144,8.734200382605195E-4,0.0018355237552896142,4.0842258022166789E-4,0.0015290408628061414,0.0015000494895502925,9.6320785814896226E-4,0.0020549825858324766,8.3283131243661046E-4,0.010421878658235073,0.0038363311905413866,0.0046763280406594276,0.0027385822031646967,0.0038813413120806217,0.0015162682393565774,0.002276112325489521,0.001282435143366456,5.9747812338173389E-4,0.0023298461455851793,0.0018611971754580736,0.0049049793742597103,0.0012473735259845853,6.8270455813035369E-4,0.0023495953064411879,0.0036748421844094992,0.0051124636083841324,8.4203475853428245E-4,0.0091719869524240494,0.0063095781952142715,0.0019750043284147978,0.0070182285271584988,0.0024153329432010651,0.0025410866364836693,0.0031419885344803333,7.6850247569382191E-4,0.0040694042108952999,0.0048423898406326771,9.0588483726605773E-4,3.6083745271753287E-6,0.0012674520257860422,0.0030974638648331165,0.001785148517228663,0.0020076541695743799,0.0012950059026479721,7.4753136141225696E-4,0.0010154105257242918,0.0016975558828562498,0.0013453126884996891,8.0278218956664205E-4,0.004713479895144701,0.0019998790230602026,0.0096590043976902962,9.143862989731133E-4,0.0078469580039381981,0.0012668921845033765,9.7041466506198049E-4,0.0076089510694146156,7.5611629290506244E-4,0.0013398549053817987,0.0030668287072330713,1.7199829744640738E-4,1.9925963715650141E-4,0.0026601944118738174,9.6107990248128772E-4,8.676016004756093E-4,0.0087997298687696457,0.0029215696267783642,7.8615109669044614E-4,0.0037260791286826134,0.0028270070906728506,0.0023329653777182102,0.0023401179350912571,0.0018938812427222729,0.0036780675873160362,0.001616473775357008,0.002752846572548151,0.0012315113563090563,0.0029990077018737793,9.1660179896280169E-4,0.0029163851868361235,0.0018211432034149766,0.0016218023374676704,0.0023492893669754267,0.0018663341179490089,0.0045333378948271275,0.001361705013550818,6.8844843190163374E-4,4.7163269482553005E-4,0.0047624651342630386,0.00135762058198452,0.0060516661033034325,0.0022312940564006567,0.008293474093079567,0.004325703252106905,0.0017303064232692122,0.0029435751494020224,0.0013088270789012313,0.0011245716596022248,7.3323328979313374E-4,0.0022164643742144108,9.8080513998866081E-4,0.0012391000054776669,1.4818987983744591E-4,0.0028330301865935326,0.0021087001077830791,0.0048765284009277821,3.2169840415008366E-4,0.0037853834219276905,0.0040191616863012314,0.0018164232606068254,0.0023197156842797995,0.0036960593424737453,0.0011040649842470884,0.0026917767245322466,1.3223118730820715E-4,0.0012565108481794596,0.0015201573260128498,0.0013300299178808928,0.0029244846664369106,0.0022792888339608908,1.0473844304215163E-4,0.0021307552233338356,0.0016131929587572813,0.0027964867185801268,0.0024337123613804579,0.0030806327704340219,0.0025098666083067656,0.0035855153109878302,0.0021915496326982975,0.0031617754139006138,0.0037295869551599026,0.0013254607329145074,0.0039099776186048985,7.2966527659446001E-4,0.0010063642403110862,0.0031267828308045864,0.0011777554173022509,2.6265054475516081E-4,4.717910778708756E-4,0.0031914669089019299,0.0012601775815710425,0.0018946105847135186,0.0028615675400942564,0.0018196285236626863,0.0020886044949293137,8.4353372221812606E-4,0.0017051557078957558,0.0017562382854521275,0.0019051943672820926,0.01317120436578989,0.0024567029904574156,0.0028736994136124849,0.0010744257597252727,0.0033628211822360754,1.5389053442049772E-4,5.720420740544796E-4,2.9517407529056072E-4,0.0049000633880496025,0.0070185670629143715,0.0015057801501825452}>>, tensor<256x!quant.uniform<i32:f32:0, {3.432705852901563E-5,2.1255451429169625E-4,2.2376996639650315E-4,9.5968258392531425E-5,1.6129820141941309E-4,7.3428498581051826E-5,1.427441748091951E-4,6.5779447322711349E-4,9.0637826360762119E-5,2.2839615121483803E-4,3.4216177300550044E-4,3.4190368751296774E-5,2.276962623000145E-4,3.1243867124430835E-4,5.600460572168231E-4,2.4202611530199647E-4,2.2918570903129876E-4,3.9829223533160985E-4,2.5543887750245631E-4,7.701007416471839E-5,1.2520160817075521E-4,2.6825926033779979E-4,4.8048209282569587E-4,8.955847006291151E-4,5.0213863141834736E-4,2.4984931224025786E-4,2.4464636226184666E-4,1.8394237849861383E-4,5.5165158119052649E-4,9.8927099315915257E-5,7.0358789525926113E-4,3.7737368984380737E-5,2.3330612748395652E-4,4.2231602128595114E-4,4.8227701336145401E-4,3.4891211544163525E-4,7.7725846495013684E-5,3.5363505594432354E-4,4.1075117769651115E-4,8.9336077508050948E-5,7.3959410656243563E-4,3.5560212563723326E-4,4.3049227679148316E-4,2.9742083279415965E-4,1.2113162665627897E-4,2.3862253874540329E-4,2.3428809072356671E-4,2.5182368699461222E-4,6.2532647280022502E-4,5.5533525301143527E-4,6.0008187574567273E-5,1.6004775534383953E-4,1.6939979104790837E-4,2.0989451149944216E-4,3.1830705120228231E-4,4.0802560397423804E-4,3.2071003806777298E-4,3.3674592850729823E-4,1.2402325228322297E-4,3.859135031234473E-4,5.1524181617423892E-4,1.2394168879836798E-4,1.8349432502873242E-4,7.2691123932600021E-5,7.3703634552657604E-4,3.4124549711123109E-4,7.7691872138530016E-4,2.9660481959581375E-4,1.3874196156393737E-4,4.4500580406747758E-4,2.3350807896349579E-4,1.310468214796856E-4,3.7257585063343868E-5,3.2871603616513312E-4,2.7181339100934565E-4,1.4787755389988888E-5,1.0428381938254461E-4,0.0011192361125722528,5.1917735254392028E-4,0.001060343929566443,3.0413962667807937E-4,9.1098940174560994E-5,1.2916378909721971E-4,5.3742941236123443E-4,3.2566601294092834E-4,2.6285767671652138E-4,2.3282255278900266E-4,5.3228100296109915E-4,2.5630882009863853E-4,1.3588220463134348E-4,8.2841736730188131E-4,3.1237778603099287E-4,6.2173831975087523E-4,3.1567466794513166E-4,1.8815191288013011E-4,4.181716067250818E-4,2.3757958842907101E-4,1.1479095701361075E-4,2.4123732873704284E-4,5.3677744290325791E-5,2.00957219931297E-4,1.9714696099981666E-4,1.2659149069804698E-4,2.7008014149032533E-4,1.094565013772808E-4,0.0013697160175070167,5.0419737817719579E-4,6.1459565768018365E-4,3.599235787987709E-4,5.1011296454817057E-4,1.9927855464629829E-4,2.991425571963191E-4,1.6854656860232353E-4,7.852473936509341E-5,3.0620463076047599E-4,2.4461152497678995E-4,6.4464658498764038E-4,1.6393853002227843E-4,8.9725792349781841E-5,3.0880019767209888E-4,4.8297338071279228E-4,6.7191565176472068E-4,1.106660783989355E-4,0.0012054465478286147,8.2924880553036928E-4,2.595688565634191E-4,9.2238455545157194E-4,3.1743990257382393E-4,3.3396732760593295E-4,4.1294205584563315E-4,1.0100195504492149E-4,5.3482950897887349E-4,6.3642062013968825E-4,1.1905770224984735E-4,4.7423773708032968E-7,1.665773888817057E-4,4.0709029417484999E-4,2.3461667296942323E-4,2.6385992532595992E-4,1.7019870574586093E-4,9.8245785920880734E-5,1.3345234037842602E-4,2.2310463828034699E-4,1.7681038298178464E-4,1.0550723527558148E-4,6.1947840731590986E-4,2.6283806073479354E-4,0.0012694537872448564,1.2017502740491182E-4,0.0010313019156455994,1.6650381439831108E-4,1.2753866030834615E-4,0.0010000214679166675,9.9374075944069773E-5,1.7609307542443275E-4,4.0306401206180453E-4,2.2605216145166196E-5,2.6188090487266891E-5,3.4962131758220494E-4,1.26311817439273E-4,1.1402625386836007E-4,0.0011565218446776271,3.8397306343540549E-4,1.0332145757274702E-4,4.8970733769237995E-4,3.7154500023461878E-4,3.0661458731628954E-4,3.0755461193621159E-4,2.4890707572922111E-4,4.8339730710722506E-4,2.1244825620669872E-4,3.6179830203764141E-4,1.6185380809474736E-4,3.9415049832314253E-4,1.2046620395267382E-4,3.8329168455675244E-4,2.3934734053909779E-4,2.131485816789791E-4,3.0876000528223813E-4,2.452866465318948E-4,5.958029069006443E-4,1.789647649275139E-4,9.0480694780126214E-5,6.1985258071217686E-5,6.2591640744358301E-4,1.7842795932665467E-4,7.9535215627402067E-4,2.9325223295018077E-4,0.0010899861808866262,5.6851410772651434E-4,2.2740893473383039E-4,3.8686516927555203E-4,1.7201517766807228E-4,1.4779904449824244E-4,9.6366631623823196E-5,2.9130320763215423E-4,1.2890425568912178E-4,1.6285116726066917E-4,1.9476146917440929E-5,3.7233659531921148E-4,2.7714009047485888E-4,6.4090738305822015E-4,4.2279847548343241E-5,4.9750151811167598E-4,5.2822625730186701E-4,2.3872702149674296E-4,3.048732178285718E-4,4.857619060203433E-4,1.451039279345423E-4,3.5377207677811384E-4,1.7378744814777747E-5,1.651394268264994E-4,1.9978967611677945E-4,1.7480181122664362E-4,3.8435618625953794E-4,2.9956002254039049E-4,1.3765456969849765E-5,2.8003871557302773E-4,2.1201706840656698E-4,3.6753379390574992E-4,3.1985546229407191E-4,4.0487825754098594E-4,3.2986418227665126E-4,4.7123341937549412E-4,2.8802873566746712E-4,4.1554257040843368E-4,4.9016834236681461E-4,1.7420129734091461E-4,5.1387655548751354E-4,9.5897703431546688E-5,1.3226340524852276E-4,4.1094361222349107E-4,1.5478883869946003E-4,3.4519365726737306E-5,6.2006074585951865E-5,4.1944484109990299E-4,1.65621328051202E-4,2.4900294374674559E-4,3.760871768463403E-4,2.3914827033877373E-4,2.7449897606857121E-4,1.1086308222729713E-4,2.2410345263779163E-4,2.3081708059180528E-4,2.5039393221959472E-4,0.0017310515977442265,3.2287705107592046E-4,3.7768163019791245E-4,1.4120852574706078E-4,4.4196541421115398E-4,2.0225366824888624E-5,7.518175698351115E-5,3.8793834391981363E-5,6.4400047995150089E-4,9.2242902610450983E-4,1.9790012447629124E-4}>>) -> tensor<4x256x56x56x!quant.uniform<i8:f32, 0.17478941380977631:28>>
    %8 = "top.Weight"() {name = "resnet50/conv2_block1_1_conv/Conv2D;StatefulPartitionedCall/resnet50/conv2_block1_1_conv/Conv2D"} : () -> tensor<64x64x1x1x!quant.uniform<i8<-127:127>:f32:0, {0.0014386754482984543,0.0024319449439644814,0.0023842721711844206,0.0016854761634021997,0.0013638436794281006,0.0026793347205966711,0.0025534608867019415,0.0012157575692981482,0.0025660768151283264,0.0015385092701762915,0.0016964178066700697,0.002495492110028863,0.0011023455299437046,0.0031117424368858337,8.4568903548642993E-4,0.0017665271880105138,0.0022262339480221272,0.0022151828743517399,0.0033441826235502958,0.0024095510598272085,0.0018689834978431463,0.0029438470955938101,0.0033126380294561386,0.0020793001167476177,0.0026777095627039671,0.0045863324776291847,0.0027382443659007549,0.0033678906038403511,0.0028943275101482868,0.0047408733516931534,0.0020733347628265619,0.0018610752886161208,0.0037532688584178686,0.0018077053828164935,0.0030320938676595688,0.0017663167091086507,0.0029504855629056692,0.001795480027794838,0.0026503137778490782,0.0044481325894594193,0.0059912395663559437,0.0048336726613342762,6.1275210464373231E-4,0.0024166898801922798,0.0033499002456665039,0.0063533918000757694,0.0026717758737504482,0.0012835225788876414,0.0019569764845073223,0.0047668716870248318,0.0018664851086214185,0.0032617698889225721,0.0046263481490314007,0.0066187749616801739,0.0019670508336275816,0.0030257515609264374,0.0016626652795821428,0.0016774667892605066,0.0065274043008685112,0.0028142002411186695,0.0018841744167730212,0.0025619654916226864,0.0033741388469934464,0.0023007385898381472}>>
    %9 = "top.Weight"() {name = "resnet50/conv2_block1_1_bn/FusedBatchNormV3;StatefulPartitionedCall/resnet50/conv2_block1_1_bn/FusedBatchNormV3"} : () -> tensor<64x!quant.uniform<i32:f32:0, {1.8908076162915677E-4,3.1962315551936626E-4,3.1335768289864063E-4,2.2151703888084739E-4,1.7924584972206503E-4,3.521368489600718E-4,3.3559364965185523E-4,1.597833470441401E-4,3.3725172397680581E-4,2.0220161241013557E-4,2.2295505914371461E-4,3.2797496533021331E-4,1.4487793669104576E-4,4.0896690916270018E-4,1.1114634980913252E-4,2.321693318663165E-4,2.9258718132041395E-4,2.9113478376530111E-4,4.3951580300927162E-4,3.1668000156059861E-4,2.4563484475947917E-4,3.869009087793529E-4,4.3536999146454036E-4,2.7327612042427063E-4,3.5192325594834983E-4,6.0276780277490616E-4,3.5987916635349393E-4,4.4263168820179999E-4,3.8039271021261811E-4,6.2307866755872965E-4,2.7249212143942714E-4,2.4459548876620829E-4,4.9328076420351863E-4,2.3758124734740704E-4,3.9849893073551357E-4,2.3214166867546737E-4,3.8777338340878487E-4,2.3597451217938215E-4,3.4832273377105594E-4,5.8460462605580688E-4,7.8741047764196992E-4,6.3527497695758939E-4,8.0532154242973775E-5,3.1761825084686279E-4,4.4026726391166449E-4,8.3500705659389495E-4,3.5114341881126165E-4,1.6868948296178132E-4,2.5719951372593641E-4,6.264955154620111E-4,2.453064953442663E-4,4.2868455057032406E-4,6.0802692314609885E-4,8.6988555267453194E-4,2.585235342849046E-4,3.9766536792740226E-4,2.1851906785741448E-4,2.2046438243705779E-4,8.5787702118977904E-4,3.698618384078145E-4,2.4763133842498064E-4,3.3671138226054609E-4,4.4345285277813673E-4,3.0237910686992109E-4}>>
    %10 = "top.Conv"(%4, %8, %9) {dilations = [1, 1], do_relu = true, kernel_shape = [1, 1], name = "resnet50/conv2_block1_1_relu/Relu;StatefulPartitionedCall/resnet50/conv2_block1_1_relu/Relu;resnet50/conv2_block1_1_bn/FusedBatchNormV3;StatefulPartitionedCall/resnet50/conv2_block1_1_bn/FusedBatchNormV3;resnet50/conv2_block3_2_bn/FusedBatchNormV3;StatefulPartitionedCall/resnet50/conv2_block3_2_bn/FusedBatchNormV3;unknown_6;resnet50/conv2_block3_2_conv/BiasAdd;StatefulPartitionedCall/resnet50/conv2_block3_2_conv/BiasAdd;resnet50/conv2_block3_2_conv/Conv2D;StatefulPartitionedCall/resnet50/conv2_block3_2_conv/Conv2D;resnet50/conv2_block1_1_conv/BiasAdd;StatefulPartitionedCall/resnet50/conv2_block1_1_conv/BiasAdd;resnet50/conv2_block1_1_conv/Conv2D;StatefulPartitionedCall/resnet50/conv2_block1_1_conv/Conv2D", pads = [0, 0, 0, 0], strides = [1, 1]} : (tensor<4x64x56x56x!quant.uniform<i8:f32, 0.13142697513103485:-128>>, tensor<64x64x1x1x!quant.uniform<i8<-127:127>:f32:0, {0.0014386754482984543,0.0024319449439644814,0.0023842721711844206,0.0016854761634021997,0.0013638436794281006,0.0026793347205966711,0.0025534608867019415,0.0012157575692981482,0.0025660768151283264,0.0015385092701762915,0.0016964178066700697,0.002495492110028863,0.0011023455299437046,0.0031117424368858337,8.4568903548642993E-4,0.0017665271880105138,0.0022262339480221272,0.0022151828743517399,0.0033441826235502958,0.0024095510598272085,0.0018689834978431463,0.0029438470955938101,0.0033126380294561386,0.0020793001167476177,0.0026777095627039671,0.0045863324776291847,0.0027382443659007549,0.0033678906038403511,0.0028943275101482868,0.0047408733516931534,0.0020733347628265619,0.0018610752886161208,0.0037532688584178686,0.0018077053828164935,0.0030320938676595688,0.0017663167091086507,0.0029504855629056692,0.001795480027794838,0.0026503137778490782,0.0044481325894594193,0.0059912395663559437,0.0048336726613342762,6.1275210464373231E-4,0.0024166898801922798,0.0033499002456665039,0.0063533918000757694,0.0026717758737504482,0.0012835225788876414,0.0019569764845073223,0.0047668716870248318,0.0018664851086214185,0.0032617698889225721,0.0046263481490314007,0.0066187749616801739,0.0019670508336275816,0.0030257515609264374,0.0016626652795821428,0.0016774667892605066,0.0065274043008685112,0.0028142002411186695,0.0018841744167730212,0.0025619654916226864,0.0033741388469934464,0.0023007385898381472}>>, tensor<64x!quant.uniform<i32:f32:0, {1.8908076162915677E-4,3.1962315551936626E-4,3.1335768289864063E-4,2.2151703888084739E-4,1.7924584972206503E-4,3.521368489600718E-4,3.3559364965185523E-4,1.597833470441401E-4,3.3725172397680581E-4,2.0220161241013557E-4,2.2295505914371461E-4,3.2797496533021331E-4,1.4487793669104576E-4,4.0896690916270018E-4,1.1114634980913252E-4,2.321693318663165E-4,2.9258718132041395E-4,2.9113478376530111E-4,4.3951580300927162E-4,3.1668000156059861E-4,2.4563484475947917E-4,3.869009087793529E-4,4.3536999146454036E-4,2.7327612042427063E-4,3.5192325594834983E-4,6.0276780277490616E-4,3.5987916635349393E-4,4.4263168820179999E-4,3.8039271021261811E-4,6.2307866755872965E-4,2.7249212143942714E-4,2.4459548876620829E-4,4.9328076420351863E-4,2.3758124734740704E-4,3.9849893073551357E-4,2.3214166867546737E-4,3.8777338340878487E-4,2.3597451217938215E-4,3.4832273377105594E-4,5.8460462605580688E-4,7.8741047764196992E-4,6.3527497695758939E-4,8.0532154242973775E-5,3.1761825084686279E-4,4.4026726391166449E-4,8.3500705659389495E-4,3.5114341881126165E-4,1.6868948296178132E-4,2.5719951372593641E-4,6.264955154620111E-4,2.453064953442663E-4,4.2868455057032406E-4,6.0802692314609885E-4,8.6988555267453194E-4,2.585235342849046E-4,3.9766536792740226E-4,2.1851906785741448E-4,2.2046438243705779E-4,8.5787702118977904E-4,3.698618384078145E-4,2.4763133842498064E-4,3.3671138226054609E-4,4.4345285277813673E-4,3.0237910686992109E-4}>>) -> tensor<4x64x56x56x!quant.uniform<i8:f32, 0.058137226849794388:-128>>
    %11 = "top.Weight"() {name = "resnet50/conv2_block1_2_conv/Conv2D;StatefulPartitionedCall/resnet50/conv2_block1_2_conv/Conv2D"} : () -> tensor<64x64x3x3x!quant.uniform<i8<-127:127>:f32:0, {8.9172570733353496E-4,0.0014116351958364248,0.0010394755518063903,9.6067320555448532E-4,0.001293024979531765,0.001817860291339457,0.0010666762245818973,6.5293407533317804E-4,5.6814256822690368E-4,6.701488746330142E-4,0.0014875448541715741,8.9068978559225798E-4,0.0019582691602408886,7.7101896749809384E-4,0.0018276964547112584,7.2723842458799481E-4,6.9559330586344004E-4,7.9936656402423978E-4,0.0023544393479824066,6.0228834627196193E-4,0.0012904062168672681,0.0012011289363726974,0.0014058436499908566,0.0010641533881425858,0.0015985179925337434,0.0024019773118197918,0.0012207493418827653,8.0672668991610408E-4,7.2943128179758787E-4,4.9947592196986079E-4,0.001285270438529551,0.0020483690313994884,0.0010299311252310872,7.8144151484593749E-4,0.0015394752845168114,0.0010229285107925534,7.2727486258372664E-4,0.0014262766344472766,8.3960103802382946E-4,0.0012142970226705074,0.0015370927285403013,4.3552581337280571E-4,0.0013317344710230827,7.0333265466615558E-4,0.0011451365426182747,0.0012814168585464358,6.2095373868942261E-4,9.2208164278417826E-4,0.0011358435731381178,0.0018791864858940244,8.5156189743429422E-4,0.001276698661968112,6.7730830051004887E-4,6.8723410367965698E-4,0.0010570953600108624,0.0015371651388704777,4.9294187920168042E-4,8.8699039770290256E-4,0.001512839226052165,0.0013535728212445974,0.0011296261800453067,0.0014570660423487425,5.5701768724247813E-4,0.0012258243514224887}>>
    %12 = "top.Weight"() {name = "resnet50/conv2_block1_2_bn/FusedBatchNormV3;StatefulPartitionedCall/resnet50/conv2_block1_2_bn/FusedBatchNormV3"} : () -> tensor<64x!quant.uniform<i32:f32:0, {5.184246037970297E-5,8.2068552728742361E-5,6.0432226746343076E-5,5.5850876378826797E-5,7.517288759117946E-5,1.056853579939343E-4,6.201359792612493E-5,3.7959776818752289E-5,3.3030231861630455E-5,3.896059570251964E-5,8.6481733887922019E-5,5.1782233640551567E-5,1.1384833487682045E-4,4.4824904762208462E-5,1.0625720460666344E-4,4.2279625631636009E-5,4.0439867007080466E-5,4.64729564555455E-5,1.3688056787941605E-4,3.5015375033253804E-5,7.5020638178102672E-5,6.9830304710194468E-5,8.1731850514188409E-5,6.1866929172538221E-5,9.2933405539952218E-5,1.3964429672341794E-4,7.0970978413242847E-5,4.690085188485682E-5,4.2407111322972924E-5,2.9038144930382259E-5,7.4722061981447041E-5,1.1908649321412668E-4,5.9877340390812606E-5,4.543084287433885E-5,8.9500827016308904E-5,5.9470225096447393E-5,4.2281742935301736E-5,8.291976701002568E-5,4.8812074965098873E-5,7.0595859142486006E-5,8.9362307335250079E-5,2.5320263375760987E-5,7.7423348557204008E-5,4.0889808587962762E-5,6.6575063101481646E-5,7.4498020694591105E-5,3.6100529541727155E-5,5.360726936487481E-5,6.603479414479807E-5,1.0925069364020601E-4,4.9507445510243997E-5,7.422371709253639E-5,3.9376827771775424E-5,3.9953883970156312E-5,6.1456594266928732E-5,8.9366520114708692E-5,2.8658274459303357E-5,5.1567163609433919E-5,8.7952277681324631E-5,7.8692966781090945E-5,6.5673331846483052E-5,8.4709776274394244E-5,3.2383464713348076E-5,7.1266025770455599E-5}>>
    %13 = "top.Conv"(%10, %11, %12) {dilations = [1, 1], do_relu = true, kernel_shape = [3, 3], name = "resnet50/conv2_block1_2_relu/Relu;StatefulPartitionedCall/resnet50/conv2_block1_2_relu/Relu;resnet50/conv2_block1_2_bn/FusedBatchNormV3;StatefulPartitionedCall/resnet50/conv2_block1_2_bn/FusedBatchNormV3;resnet50/conv2_block3_2_bn/FusedBatchNormV3;StatefulPartitionedCall/resnet50/conv2_block3_2_bn/FusedBatchNormV3;unknown_6;resnet50/conv2_block3_2_conv/BiasAdd;StatefulPartitionedCall/resnet50/conv2_block3_2_conv/BiasAdd;resnet50/conv2_block3_2_conv/Conv2D;StatefulPartitionedCall/resnet50/conv2_block3_2_conv/Conv2D;resnet50/conv2_block1_2_conv/BiasAdd;StatefulPartitionedCall/resnet50/conv2_block1_2_conv/BiasAdd;resnet50/conv2_block1_2_conv/Conv2D;StatefulPartitionedCall/resnet50/conv2_block1_2_conv/Conv2D", pads = [0, 0, 0, 0], strides = [1, 1]} : (tensor<4x64x56x56x!quant.uniform<i8:f32, 0.058137226849794388:-128>>, tensor<64x64x3x3x!quant.uniform<i8<-127:127>:f32:0, {8.9172570733353496E-4,0.0014116351958364248,0.0010394755518063903,9.6067320555448532E-4,0.001293024979531765,0.001817860291339457,0.0010666762245818973,6.5293407533317804E-4,5.6814256822690368E-4,6.701488746330142E-4,0.0014875448541715741,8.9068978559225798E-4,0.0019582691602408886,7.7101896749809384E-4,0.0018276964547112584,7.2723842458799481E-4,6.9559330586344004E-4,7.9936656402423978E-4,0.0023544393479824066,6.0228834627196193E-4,0.0012904062168672681,0.0012011289363726974,0.0014058436499908566,0.0010641533881425858,0.0015985179925337434,0.0024019773118197918,0.0012207493418827653,8.0672668991610408E-4,7.2943128179758787E-4,4.9947592196986079E-4,0.001285270438529551,0.0020483690313994884,0.0010299311252310872,7.8144151484593749E-4,0.0015394752845168114,0.0010229285107925534,7.2727486258372664E-4,0.0014262766344472766,8.3960103802382946E-4,0.0012142970226705074,0.0015370927285403013,4.3552581337280571E-4,0.0013317344710230827,7.0333265466615558E-4,0.0011451365426182747,0.0012814168585464358,6.2095373868942261E-4,9.2208164278417826E-4,0.0011358435731381178,0.0018791864858940244,8.5156189743429422E-4,0.001276698661968112,6.7730830051004887E-4,6.8723410367965698E-4,0.0010570953600108624,0.0015371651388704777,4.9294187920168042E-4,8.8699039770290256E-4,0.001512839226052165,0.0013535728212445974,0.0011296261800453067,0.0014570660423487425,5.5701768724247813E-4,0.0012258243514224887}>>, tensor<64x!quant.uniform<i32:f32:0, {5.184246037970297E-5,8.2068552728742361E-5,6.0432226746343076E-5,5.5850876378826797E-5,7.517288759117946E-5,1.056853579939343E-4,6.201359792612493E-5,3.7959776818752289E-5,3.3030231861630455E-5,3.896059570251964E-5,8.6481733887922019E-5,5.1782233640551567E-5,1.1384833487682045E-4,4.4824904762208462E-5,1.0625720460666344E-4,4.2279625631636009E-5,4.0439867007080466E-5,4.64729564555455E-5,1.3688056787941605E-4,3.5015375033253804E-5,7.5020638178102672E-5,6.9830304710194468E-5,8.1731850514188409E-5,6.1866929172538221E-5,9.2933405539952218E-5,1.3964429672341794E-4,7.0970978413242847E-5,4.690085188485682E-5,4.2407111322972924E-5,2.9038144930382259E-5,7.4722061981447041E-5,1.1908649321412668E-4,5.9877340390812606E-5,4.543084287433885E-5,8.9500827016308904E-5,5.9470225096447393E-5,4.2281742935301736E-5,8.291976701002568E-5,4.8812074965098873E-5,7.0595859142486006E-5,8.9362307335250079E-5,2.5320263375760987E-5,7.7423348557204008E-5,4.0889808587962762E-5,6.6575063101481646E-5,7.4498020694591105E-5,3.6100529541727155E-5,5.360726936487481E-5,6.603479414479807E-5,1.0925069364020601E-4,4.9507445510243997E-5,7.422371709253639E-5,3.9376827771775424E-5,3.9953883970156312E-5,6.1456594266928732E-5,8.9366520114708692E-5,2.8658274459303357E-5,5.1567163609433919E-5,8.7952277681324631E-5,7.8692966781090945E-5,6.5673331846483052E-5,8.4709776274394244E-5,3.2383464713348076E-5,7.1266025770455599E-5}>>) -> tensor<4x64x56x56x!quant.uniform<i8:f32, 0.049302853643894196:-128>>
